plantalog/cadi-gcl/stm32f100/grolly/current/main.c
#define FMP_PROGRAMS_AMOUNT						9

// Fertilizer Mixing Program adresses	()
#define FMP_OFFSET								0x068A	// 1674
#define FMP_SIZE								5
#define FMP_DOSING_PUMP_ID_SHIFT				1		// 1675 FMP enabled if dosing pump id > 0 (05.09.2014)
#define FMP_DOSING_TIME_SHIFT					2		// 1676
#define FMP_2_WP_ASSOC_SHIFT					3		// 16770 H
#define FMP_TRIG_FREQUENCY_SHIFT				3		// 16771 L
#define	FMP_AFTERMIX_TIME_SHIFT					4		// 1678

#define DOSER_SPEEDS			0x0617		// 4 bytes for doser speeds in percent (1..100)


#define COMM_MONITOR_MODE		48
#define COMM_GET_SETTINGS		49
#define COMM_SET_SETTINGS		50
#define COMM_DIRECT_DRIVE		51

#define FWTANK_TOP			0x05D6		// 1494
#define FWTANK_BOTTOM		0x05D7		// 1495

#define MIXTANK_TOP				0x05D8		// 1496
#define MIXTANK_BOTTOM			0x05D9		// 1497

#define WFM_CAL_OFFSET			0x0642	// 1602


#define DAY						1
#define NIGHT					0

#define BSRRL					BSRR
#define BSRRH					BRR


#define LOG_SHIFT	1

// analog inputs
#define JDR_EC		ADC1->JDR3		// continuous ADC channel for EC
#define JDR_PH		ADC1->JDR2		// continuous ADC channel for pH
#define JDR_PSI		ADC1->JDR2		// pressure sensor
#define JDR_CO2		ADC1->JDR3		// CO2 sensor
#define JDR_BUFFER_SIZE 10


#define PSI_SENSOR_0PSI			0x0645
#define PSI_SENSOR_32PSI		0x0646
#define PSI_SENSOR_BTM			0x0615			// 1557
#define PSI_SENSOR_TOP			0x0616			// 1558
volatile static uint8_t psi_underOver=0;
volatile static uint16_t psi_pump_top_level=0;
volatile static uint16_t psi_pump_btm_level=0;

#define AVG_ADC_EC		3			// adcAverage[AVG_ADC_EC]
#define AVG_ADC_PH		2			// adcAverage[2]
#define AVG_ADC_PSI		2			// adcAverage[2]
#define AVG_ADC_CO2		2


volatile static uint16_t tank_windows_top[2];
volatile static uint16_t tank_windows_bottom[2];

ErrorStatus  HSEStartUpStatus;
FLASH_Status FlashStatus;

volatile static uint16_t adcAverage[4];

volatile static uint8_t wpStateFlags;
volatile static uint8_t dosingPumpStateFlags;	// this variable seems to be overwritten by some part of this firmware, therefore dosingPumpStateFlags2 used instead
volatile static uint8_t dosingPumpStateFlags2;
volatile uint16_t wfCalArray[WFM_AMOUNT];


#define STATE_NOTHING					0
#define STATE_CONFIGURATION_PAYLOAD		1
#define STATE_CONFIGURATION_CRC			2
#define STATE_COMMAND_TYPE				3
#define STATE_COMMAND_PAYLOAD			4
#define STATE_COMMAND_CRC				5


#define RXM_NONE						0
#define RXM_CMD							4
#define RXM_SET							3
volatile static uint8_t prefixDetectionIdx=0;
volatile static uint8_t pb_pntr=0;			// packet buffer pointer
volatile static uint8_t packet_length=0;
volatile static uint8_t rxm_state=0;
volatile static uint8_t packet_ready=0;		// packet readiness flag. reset after command execution

volatile static uint8_t runners=0;
volatile prostohujnja = 0;

void hygroStatSettings(void);
uint8_t readPercentVal(uint8_t value);
uint32_t measureDelay(void);
void phMonSettings(void);
void setTimer(uint8_t timerId);
//void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
void copy_arr(uint8_t volatile *source, volatile uint8_t *destination, uint8_t amount, uint8_t pos);
void Lcd_write_arr(volatile uint8_t *STRING, uint8_t chars);
void Lcd_write_digit(uint8_t numb);
void Delay_us(uint32_t delay);
void buttonCalibration(void);
void Init_pin_out(void);
void Init_pin_in(void);
void Init_lcd(void);
void Lcd_write_data(uint8_t byte);
void Lcd_write_cmd(uint8_t byte);
void Lcd_clear(void);
void Return_home(void);
void Lcd_goto(uc8 x, uc8 y);
void Lcd_write_str(volatile uint8_t *STRING);
char* adc2str(uint_fast16_t d, volatile char* out);
void int32str(uint32_t d, volatile char *out);
void AdcInit(void);
uint32_t RTC_GetCounter(void);
void RTC_SetCounter(uint32_t value);
unsigned char RtcInit(void);
uint8_t readButtons(void);
void focusMenuItem(uint8_t itemId);
uint8_t menuSelector(void);
uint32_t timeAdjust(uint32_t cnt, uint8_t includeDays);
void programRunner(uint8_t programId);
RTC_DateTime unix2DateTime(uint32_t unixtime);
uint32_t DateTime2unix(RTC_DateTime datetime);
void EE_WriteWord(uint16_t Address, uint32_t Data);
uint32_t EE_ReadWord(uint16_t Address);
//void Lcd_print(char *STRING);
void setCTimer(uint8_t timerId);
uint32_t CTimerAdjust(uint32_t time);
void plugStateSet(uint8_t plug, uint8_t state);
void getPh();
void psiStab(void);
void getEc(void);
FRESULT string2log(char* str, uint8_t bytes);
FRESULT sdLog2(void);
uint8_t adjust8bit(uint8_t val);
void loggerSettings(void);
uint8_t yesNoSelector(char str, uint8_t curval);
void loadSettings(void);
void set4lowBits(uint8_t dta);
void set4highBits(uint8_t dta);
void flush_lcd_buffer(void);
// void phStabSettings(void);
void Lcd_write_16int(uint16_t);
void saveButtonRanges(void);
void readButtonRanges(void);
void set16bit(uint16_t value);
void convPh2str(uint8_t ph, char* phstr);
uint8_t readPhVal(uint8_t value);
void dht_conv_data(void);
void dht_init(void);
void dht_init_out(void);
void TIM3_IRQHandler(void);
void TIM1_BRK_TIM15_IRQHandler(void);
void dht_arr_displayer(void);
void setPwmDc(uint8_t duty_cycle);
void setDutyCycle(void);
void displayAdcValues(void);
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);

void water_program_setup(uint8_t progId);
void fertilization_setup(void);
void watering_setup(void);
void fertilizer_mixing_program_setup(uint8_t progId);
void run_watering_program(uint8_t progId);
void run_fertilizer_mixer(uint8_t progId);
void startWp(void);
uint16_t adjust16bit_fast(uint16_t val, uint8_t speed);

// count crc starting from input and taking buffer from start_byte for length bytes
uint8_t crc_block(uint8_t input, volatile uint8_t *start_byte, uint8_t length);

static void lstasks(void *pvParameters);
static void uart_task(void *pvParameters);
static void prvSetupHardware( void );
static void displayClock( void *pvParameters );
static void timerStateTrigger(void *pvParameters);
static void plugStateTrigger(void *pvParameters);
static void sdLog(void *pvParameters);
static void phMonitor(void  *pvParameters);
static void vTaskLCDdraw(void *pvParameters);
static void watering_program_trigger(void *pvParameters);
void bluetooth_init(void);
void display_usart_rx(void);
void display_usart_tx(void);


void open_valve(uint8_t valveId);
void close_valve(uint8_t valveId);
void run_valve_motor(uint8_t valveId);
void stop_valve_motor(uint8_t valveId);
void valve_test(void);
void valve_feedback_init(void);
void dosing_motor_control_init(void);
void valve_motor_control_init(void);
void valve_init(void);		// startup valve config
void EXTI15_10_IRQHandler(void);
void water_level_input_init(void);
void fertilizer_mixing_program_setup(uint8_t progId);
uint16_t adjust16bit(uint16_t val);
void enable_dosing_pump(uint8_t pumpId, uint8_t state);
void valveMotorStateSet(uint8_t valveId, uint8_t state);
void USART1_IRQHandler(void);
void StartDMAChannel4(uint8_t LengthBufer);
unsigned char GetStateDMAChannel4(void);
void TIM1_TRG_COM_TIM17_IRQHandler(void);
void TIM4_IRQHandler(void);
void tankLevelStabSetup(void);
void tankLevelStab(void);
void Lcd_write_16b(uint16_t tmp);
void Lcd_write_8b(uint8_t tmp);
void run_uart_cmd(void);
void get_water(uint8_t valve, uint8_t counter_id, uint16_t amount);
void get_water_cl(uint8_t valve, uint8_t counter_id, uint16_t amount);
void send_packet();
void setTimerSelector(void);
uint8_t idSelector(uint8_t min, uint8_t max, uint8_t curid);
void printOk(void);
void get_fertilizer(uint8_t fertId, uint8_t secs);
void get_settings_block(uint8_t block_number);
void rx_flush(void);
void adcAverager(void);
void get_status_block(uint8_t blockId);
void run_circulation_pump(uint16_t time);
void send_ee_addr(uint16_t addr, uint8_t type);
void rx_ee(uint16_t addr, uint8_t type);
void autoSafe(void);
void run_doser_for(uint8_t pump_id, uint8_t amount, uint8_t speed);
uint16_t adjustFlags(uint16_t flags, uint8_t from, uint8_t to);
void setDoserSpeed(uint8_t doser, uint8_t speed);
void send_resp(uint8_t cmd_uid);
void send_ee_block(uint16_t addr);
void eeprom_test(void);
void push_tx(void);
void psi_motor_init(void);
void psiPwm(uint8_t val);
void psi_pwm_test(void);
void getco2(void);
void co2_sens_supply(void);

// auto_flags
/*
 * 0 - PSI pump stab		(1)
 * 1 - tank level stab		(2)
 * 2 - autoSafe				(4)
 * 3 - psi underpressure	(8)
 *
 */


#define CO2_TOP		0x0619			// if ADC reading lower than this value, CO2 valve closes
#define CO2_BTM		0x061A			// if ADC reading is higher than this value, CO2 valve opens
#define CO2_400PPM	0x061B			//
#define CO2_VALVE	2				// co2 valve id

volatile static uint16_t curco2 = 0;
volatile static uint16_t co2_400ppm = 0;
volatile static uint16_t co2_top = 0;	// higher value, lower CO2 level
volatile static uint16_t co2_btm = 0;
volatile static uint32_t next_co2_run = 0;
volatile static uint16_t co2_timeout = 120;
volatile static uint32_t co2_sens_start = 0;	// when co2 sensor enabled
volatile static uint8_t co2_sensor_ready = 0;	//

#define CO2_SENSOR_12V					1		// co2 sensor driven by 12V valve id
volatile static uint8_t co2temp = 0;
void getco2(void){
	uint16_t diff = 0;
	if (next_co2_run<RTC_GetCounter() && ((auto_failures&16)>>4)==0 && co2_sensor_ready==1){	// if it's time to make a measurement
		open_valve(CO2_SENSOR_12V);		// enable CO2 sensor 12V supply
		vTaskDelay(50);		// delay to
		co2temp |= (1<<1);
		curco2 = adcAverage[AVG_ADC_CO2];	// read current CO2 ADC value

		if (curco2>co2_btm && ((valveFlags&(1<<CO2_VALVE))>>CO2_VALVE)==0) {		// if current CO2 PPM level below needed and CO2 valve still closed
			co2temp |= (1<<2);
			open_valve(CO2_VALVE);	// open valve
			co2_sens_start = RTC_GetCounter();	// remember the CO2 stab start time
		}
		vTaskDelay(10);
		diff = (uint16_t)(RTC_GetCounter() - co2_sens_start);
		if (curco2<co2_top) {					// if CO2 level reached desired
			close_valve(CO2_VALVE);				// close CO2 valve
			close_valve(CO2_SENSOR_12V);		// disable sensor 12V supply
			next_co2_run = RTC_GetCounter()+10;	// +10 seconds delay until next measure
			co2temp |= (1<<3);
		}
		if (diff>co2_timeout) {				// if CO2 control timeout exceeded
			auto_failures |= (1<<4);		// set CO2 failure flag (bit 5)
			close_valve(CO2_VALVE);				// close CO2 valve
			close_valve(CO2_SENSOR_12V);		// disable sensor 12V supply
			co2temp |= (1<<4);
		}
	}
}

#define CO2_WARMUP	60			// co2 sensor warmup
uint32_t co2_warmup_end = 0;	// co sensor warmup finish time

void co2_sens_supply(void){
	if (RTC_GetCounter()>co2_warmup_end) {
		co2_sensor_ready=1;
	}
	else {
		open_valve(CO2_SENSOR_12V);		// force 12v supply to co2 sensor
		co2_sensor_ready=0;
	}
}

