plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void co2_setup(void){
	uint16_t tmpval=0;
	Lcd_write_str("Set CO2 top lvl");
	Lcd_goto(1,0);
	Lcd_write_str("Curr = ");
	Lcd_write_16b(adcAverage[AVG_ADC_CO2]);
	vTaskDelay(3000);
	EE_ReadVariable(CO2_TOP, &co2_top);
	co2_top = adjust16bit_fast(co2_top, 1);
	EE_WriteVariable(CO2_TOP, co2_top);
	printOk();
	vTaskDelay(200);
	Lcd_write_str("Set CO2 btm lvl");
	Lcd_goto(1,0);
	Lcd_write_str("Curr = ");
	Lcd_write_16b(adcAverage[AVG_ADC_CO2]);
	vTaskDelay(3000);
	EE_ReadVariable(CO2_BTM, &co2_btm);
	tmpval = adjust16bit_fast(co2_btm, 1);
	EE_WriteVariable(CO2_BTM, co2_btm);
	printOk();
	vTaskDelay(200);
	Lcd_write_str("Set CO2=400ppm");
	Lcd_goto(1,0);
	Lcd_write_str("Curr = ");
	Lcd_write_16b(adcAverage[AVG_ADC_CO2]);
	vTaskDelay(3000);
	EE_ReadVariable(CO2_400PPM, &co2_400ppm);
	tmpval = adjust16bit_fast(co2_400ppm, 1);
	EE_WriteVariable(CO2_400PPM, co2_400ppm);
	printOk();
	vTaskDelay(200);
	loadSettings();
}

void autoSafe(void){
	if (((auto_flags&4)>>2)==1){
		// disable PSI pump in case of over pressure. PSI_OVERPRESSURE sets max
		if (adcAverage[AVG_ADC_PSI]>PSI_OVERPRESSURE) {
			plugStateSet(PSI_PUMP_ID,0);
			wpProgress = 61;
		}



		// if while running PSI pump underpressure was constant during timeout, disable PSI pump
		vTaskDelay(1);
		uint32_t now = RTC_GetCounter();


		if (((auto_flags&8)>>3)==1 && adcAverage[AVG_ADC_PSI]<psi_upres_level && (auto_flags&1)==1) {	// underpressure auto
				if (now>fup_time) {
					wpProgress=62;
					plugStateSet(PSI_PUMP_ID, 0);	// disable psi pump
					auto_failures|=8;	// set PSI program failure flag
				}
		}
		else {
			fup_time = RTC_GetCounter()+psi_upres_timeout;		// fail under pressure flag set time
			// wpProgress = 63;
		}

		vTaskDelay(1);
		if (sonar_read[FWTANK_SONAR]<tank_windows_top[FWTANK] && sonar_read[FWTANK_SONAR]>0){
			close_valve(WI_VALVE);
		}
		vTaskDelay(1);
		if (sonar_read[MIXTANK_SONAR]<tank_windows_top[MIXTANK] && sonar_read[MIXTANK_SONAR]>0){
			close_valve(FWI_VALVE);
		}
		vTaskDelay(1);
		if (sonar_read[MIXTANK_SONAR]>tank_windows_bottom[MIXTANK]){
		// 	enable_dosing_pump(MIXING_PUMP,0);	// mixer pump off
		}
	}
	vTaskDelay(1);
}



void Lcd_write_8b(uint8_t tmp) {
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx++] = (tmp/100)+48;
	}
	else {
		LCDLine2[lcd_pointerx++] = (tmp/100)+48	;
	}
	Lcd_write_digit(tmp%100);

}

void calibrateFlowMeter(void){
	uint8_t valve=0, counter_id=0, volume=0;
	uint16_t ticks_in_10cl=0;
	uint32_t cnt_val1=0, cnt_val2=0;
	Lcd_clear();
	Lcd_write_str("Choose one:");
	vTaskDelay(500);
	button = 0;
	while (button==0) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_16b(water_counter[0]);
		Lcd_write_str("2:");
		Lcd_write_16b(water_counter[1]);
		Lcd_goto(1,0);
		vTaskDelay(10);
		Lcd_write_str("3:");
		Lcd_write_16b(water_counter[2]);
		Lcd_write_str("4:");
		Lcd_write_16b(water_counter[3]);
	}
	Lcd_clear();
	counter_id = button-1;
	button=0;
	Lcd_write_str("Choose valve");
	valve = adjust8bit(valve);
	close_valve(valve);
	Lcd_clear();
	Lcd_write_str("How much x10CL?");
	volume = adjust8bit(volume);
	cnt_val1 = water_counter[counter_id];
	Lcd_clear();
	Lcd_write_str("OK to finish");
	open_valve(valve);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
		Lcd_clear();
		Lcd_write_str("Current value:");
		Lcd_goto(1,0);
		Lcd_write_16b(water_counter[counter_id]);
	}
	cnt_val2 = water_counter[counter_id];
	close_valve(valve);
	vTaskDelay(200);

	ticks_in_10cl=(uint16_t)(cnt_val2-cnt_val1)/(uint16_t)volume;	// how much ticks for 10 CL?
	wfCalArray[counter_id] = ticks_in_10cl;	// ticks in 10cl
	Lcd_clear();
	Lcd_write_str("Ticks:");
	Lcd_write_16b(cnt_val2);
	Lcd_goto(1,0);
	Lcd_write_str("10CL=");
	Lcd_write_16b(ticks_in_10cl);
	EE_WriteVariable(WFM_CAL_OFFSET, ticks_in_10cl);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
	}
	Lcd_clear();
	vTaskDelay(200);
}

void get_water_cl(uint8_t valve, uint8_t counter_id, uint16_t amount)
{
	uint32_t cnt_to_reach=0;
	cnt_to_reach = ((uint32_t)amount*(uint32_t)wfCalArray[0])/10;
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<cnt_to_reach) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water_tick(uint8_t valve, uint8_t counter_id, uint32_t ticks)
{
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<ticks) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water(uint8_t valve, uint8_t counter_id, uint16_t amount){	// amount in CL (10ml) max 65535x10=650L
	uint32_t cnt_to_reach=0;
	uint16_t volume=0;
	Lcd_clear();
	Lcd_write_str("Calibrate WFM?");
	while (button==0) {
		vTaskDelay(10);
		button=readButtons();
	}
	if (button==BUTTON_OK) {
		calibrateFlowMeter();
	}
	uint8_t repeat=1;
	while (repeat==1) {
		Lcd_clear();
		Lcd_write_str("CL amount:");
		Lcd_write_16b(wfCalArray[0]);
		volume = adjust16bit_fast(volume, 5);
		cnt_to_reach = ((uint32_t)volume*(uint32_t)wfCalArray[0])/10;

		Lcd_clear();
		Lcd_write_str("Adding");
		Lcd_write_16b((uint16_t)cnt_to_reach);
		Lcd_goto(1,0);
		Lcd_write_str("to ");
		Lcd_write_16b((uint16_t)water_counter[water_counter[counter_id]]);
		button=0;
		open_valve(0);		// HARDCODE
		water_counter[counter_id] = 0;
		while (water_counter[0]<cnt_to_reach) {
			vTaskDelay(10);
			Lcd_clear();
			Lcd_write_str("Cur:");
			Lcd_write_16b((uint16_t)water_counter[counter_id]);
			Lcd_goto(1,0);
			Lcd_write_str("of:");
			Lcd_write_16b(cnt_to_reach);
		}
		close_valve(0);		// HARDCODE
		Lcd_clear();
		Lcd_write_str("Repeat?");
		while (button==0) {
				vTaskDelay(10);
				button=readButtons();
		}
		if (button==BUTTON_OK) {
			repeat=1;
			water_counter[0]=0;
		}
		else {
			repeat=0;
		}
	}
}

void Lcd_write_16b(uint16_t tmp) {
	Lcd_write_digit((uint16_t)tmp/10000);
	Lcd_write_digit((uint16_t)(tmp%10000)/100);
	Lcd_write_digit((uint16_t)tmp%100);
}

uint8_t crc_block(uint8_t input, volatile uint8_t *start_byte, uint8_t length){
	uint8_t i=0;
	for (i=0; i<length; i++) {
		input ^= start_byte[i];
	}
	return input;
}


