plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void USART1_IRQHandler(void)
{

	uint8_t rx_packet_crc = 0;	// RxBuffer and ZXn packet header CRC
	if (USART_GetITStatus(BT_USART, USART_IT_RXNE) != RESET) {
			RxByte = USART_ReceiveData(BT_USART);	// get byte from Data Register
#ifndef		PRODUCTION_BUILD
			RxBuffer[RxCounter++] = RxByte;			// write it into RxBuffer
#endif
			USART1->SR &= ~USART_FLAG_RXNE;			// clear Rx Not Empty flag
	}



	// sending packet in case of Tx Not Empty flag is set and buffer not sent completely yet
	if (txbuff_ne==1 && TxCounter<NbrOfDataToTransfer) {
		USART1->DR = TxBuffer[TxCounter++];	// write TxBuff byte into Data Register for sending
	}
	BT_USART->SR &= ~USART_SR_TC;		// clear Transfer Complete flag

	if (packet_ready==0) {
		if (rxm_state==RXM_CMD) {
			if (pb_pntr==0) {	// if packet buffer pointer is 0, it points to payload size (payload, including this size byte)
				packet_length=RxByte;	// get packet length
			}
			RxBuffer[pb_pntr++]=RxByte;	// receive byte into cmd buffer and increase command packet buffer pointer
			if (pb_pntr==(packet_length+1)) {	// if packet buffer pointer reached packet length (rely on RXM_NONE set later)
				// crc count
				rx_packet_crc = crc_block(48, &RxBuffer[0],packet_length);	// 48 is XOR of "ZX2", -1 for skipping cmd id resp
				// crc check
				rxm_state=RXM_NONE; // RX machine state set to NONE, completes RX cycle
				pb_pntr=0;			// packet buffer pointer to 0
				prefixDetectionIdx = 0;
				if (rx_packet_crc==0) {	//
					packet_ready=1;	// packet received correctly and is ready to process
				}
				else {
					rx_flush();	// discard broken packet
				}
			}
		}

		if (RxByte==90) {
			// ready
			prefixDetectionIdx = 1;
		}
		else if (RxByte==88 && prefixDetectionIdx==1) {
			// steady
			prefixDetectionIdx = 2;
		}
		else if (prefixDetectionIdx==2) {
			if (RxByte==48) {
				// escaping zero
			}
			else if (RxByte==49){
				// settings
				rxm_state=RXM_SET;
			}
			else if (RxByte==50) {
				// command
				rxm_state=RXM_CMD;
				rx_flush();
			}
			prefixDetectionIdx = 0;
		}
	}
}

void save_settings(void){	// wrapper for rx_ee, simplifies settings packet receiving
	if (RxBuffer[0]==5) {		// 16 bit (5: size(1b), addr(2b), data(2b))
		rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 1);
	}
	if (RxBuffer[0]==7) {		// 32 bit (7: size(1b), addr(2b), data(4b))
		rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 2);
	}
}



static void lstasks(void *pvParameters){
	vTaskDelay(4000);
	while (1) {
		// low speed tasks
		tankLevelStab();
		psiStab();
		autoSafe();
		sonar_ping();
		vTaskDelay(10);
		co2_sens_supply();
		getco2();
	}
}


static void uart_task(void *pvParameters){
	while (1) {
		IWDG_ReloadCounter();
		runners&=(1<<3);
		if (packet_ready==1) {
			run_uart_cmd();	// when command packet received, run the command
			if (RxBuffer[1]<50) {	// other than get_status_block()
				send_resp(RxBuffer[RxBuffer[0]]);		// send cmd id recently run, to confirm execution
				rx_flush();
				pb_pntr=0;
			}
			packet_ready=0;
		}
		vTaskDelay(10);
	}
}

void rx_flush(void){
	uint8_t i=0;
	for (i=0; i<42; i++){		/// HARDCODE
		RxBuffer[i] = 0;
	}
}

void tx_flush(void){
	uint8_t i=0;
	NbrOfDataToTransfer = 0;
	for (i=0; i<42; i++){		// HARDCODE
		TxBuffer[i] = 0;
		vTaskDelay(1);
	}
}

void push_tx(void){
	txbuff_ne=0;	// stop Tx transfers
	NbrOfDataToTransfer = TxBuffer[3]+1;	// packet size with code 13
	TxBuffer[TxBuffer[3]] = 13;
	TxCounter=0;							// reset tx buffer pointer
	txbuff_ne=1;
	BT_USART->DR = 0;						// volshebnyj pendal
	while (TxCounter<NbrOfDataToTransfer){
		vTaskDelay(5);
		IWDG_ReloadCounter();
	}
	NbrOfDataToTransfer=0;
	tx_flush();		// flush Tx buffer
	txbuff_ne=0;	// packet sent, reset tx not empty flag
}

void send_resp(uint8_t cmd_uid){
	tx_flush();
	TxBuffer[0] = 90;	// "Z"
	TxBuffer[1] = 88;	// "X"
	TxBuffer[2] = 55;	// "7" command execution success response packet
	TxBuffer[3] = 6;	// packet size
	TxBuffer[4] = cmd_uid;
	TxBuffer[(TxBuffer[3]-1)] = crc_block(0, &TxBuffer[0],(TxBuffer[3-1]));	// with crc
	vTaskDelay(1);
	push_tx();
}

void run_uart_cmd(void){
	uint16_t addr = 0;
	switch (RxBuffer[1]) {
		// below 50 there are tasks that send responsewhen successfully executed
		case 0:
			get_water_cl(RxBuffer[2],RxBuffer[3],RxBuffer[4]*256+RxBuffer[5]);
			break;
		case 1:
			plugStateSet(RxBuffer[2], RxBuffer[3]);
			break;
		case 2:
			comm_state=COMM_DIRECT_DRIVE;
			plugStateSet(PSI_PUMP_ID, 0);	// disables PSI pump when entered CDD mode
			break;
		case 3:
			comm_state=COMM_MONITOR_MODE;
			break;
		case 4:
			open_valve(RxBuffer[2]);
			break;
		case 5:
			close_valve(RxBuffer[2]);
			break;
		case 6:
			get_settings_block(RxBuffer[2]);
			break;
		case 8:
			if (comm_state==COMM_DIRECT_DRIVE) {
				auto_flags=RxBuffer[2];	// set auto-processing flags
			}
			break;
		case 9:
//			enable_dosing_pump(RxBuffer[2], RxBuffer[3]);
			send_resp(RxBuffer[RxBuffer[0]]);
			run_doser_for(RxBuffer[2], RxBuffer[3], RxBuffer[4]);
			break;
		case 10:
//			valve_failed = RxBuffer[2];
			fup_time=RTC_GetCounter()+60;
			auto_failures=0;
			wpProgress=0;
			runners=0;
			break;
		case 11:	// stop all processes and force manual control
			auto_flags=0;
			comm_state=COMM_DIRECT_DRIVE;
			auto_failures&=1;
			plugStateSet(0,0);
			plugStateSet(1,0);
			plugStateSet(2,0);
			plugStateSet(3,0);
			close_valve(2);
			close_valve(3);
			close_valve(0);
			close_valve(1);
			close_valve(4);
			break;
		case 12:
			RTC_SetCounter(RxBuffer[2]*16777216+RxBuffer[3]*65536+RxBuffer[4]*256+RxBuffer[5]);
			break;
		case 13:
			vTaskDelay(10000);	// wait a lot for watchdog to trigger reset
			break;
		case 14:
			get_fertilizer(RxBuffer[2], RxBuffer[3]);
			break;
		case 15:	// receive 16 bit value to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 1);
			break;
		case 16:	// receive 32byte block to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 16);
			break;
		case 17:	// receive 8 bit value to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 10); 	// higher
			break;
		case 18:	// receive 8 lower bits to store into EEPROM
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			rx_ee(addr, 11);	// lower
			break;
		case 19:
			loadSettings();
			break;
		case 20:
//			valve_busy=0;
			break;
		case 21:
			break;



			// the ones not needed to send additional confirmation response
		case 51:
			get_status_block(RxBuffer[2]);
			break;
		// send full status sequence
		case 52:
			get_status_block(1);
			get_status_block(2);
			break;
		case 56:	// receive 32 bit value to store into EEPROM
			rx_ee((RxBuffer[2]&(RxBuffer[3]<<8)), 2);
			break;
		case 57:	// send 16 bit EEPROM value
			send_ee_addr((RxBuffer[2]+RxBuffer[3]*256), 1);
			break;
		case 58:	// send 32 bit EEPROM value
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			send_ee_addr(addr, 2);
			break;
		case 59:	// send block of EEPROM values
			addr = ((uint16_t)RxBuffer[2]+(uint16_t)RxBuffer[3]*256);
			send_ee_block(addr);
			break;
	}
}


void wp_next_run(uint8_t wp_id, uint32_t time){
	// setting the last run
}

// adds 'amount' seconds of fertilizer using pump with ID	 = pump_id
void run_doser_for(uint8_t pump_id, uint8_t amount, uint8_t speed){
	uint32_t finish = 0, now = 0;
	now = RTC_GetCounter();
	finish = now+amount;
	enable_dosing_pump(pump_id, speed);
	while (now<finish) {
		now = RTC_GetCounter();
		IWDG_ReloadCounter();
		vTaskDelay(10);
//		send_resp();
		get_status_block(1);	// send status blocks
		vTaskDelay(10);
	}
	enable_dosing_pump(pump_id, 0);
}

