plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void rx_ee(uint16_t addr, uint8_t type){
	uint32_t val32 = 0;
	static uint16_t val16 = 0;
	uint8_t i=0;
	if (type==1) {	// 2 bytes
		val16=(RxBuffer[4]+(RxBuffer[5]*256));
		EE_WriteVariable(addr,val16);
	}
	if (type==2) {	// 4 bytes
		val32=(RxBuffer[4]+(RxBuffer[5]*256)+(RxBuffer[6]*65536)+(RxBuffer[7]*16777216));
		EE_WriteWord(addr,val32);
	}
	if (type==16){	// 32 bytes block
		for (i=0;i<32;i++){
			val16=0;
			val16=((uint16_t)RxBuffer[(4+i*2)]+(uint16_t)RxBuffer[(5+i*2)*256]);
			EE_WriteVariable(addr++,val16);
			vTaskDelay(1);
		}
	}
	if (type==10) {	// 1 higher byte
		uint16_t tmpval=0;
		EE_ReadVariable(addr, &tmpval);
		tmpval &= (uint16_t)0xFF;
		tmpval &= (((uint16_t)RxBuffer[4])<<8);
		EE_WriteVariable(addr,tmpval);
	}
	if (type==11) {	// 1 lower byte
		uint16_t tmpval=0;
		EE_ReadVariable(addr, &tmpval);
		tmpval &= (uint16_t)0xFF00;
		tmpval &= (uint16_t)RxBuffer[4];
		EE_WriteVariable(addr,tmpval);
	}
}


void send_ee_addr(uint16_t addr, uint8_t type){	// sends EEPROM cell contents via BT-USART
	uint16_t val16;
	uint32_t val32;
	// types: 0 - 8 bit, 1 - 16bit, 2 - 32bit
	TxBuffer[0] = 90;	// "Z"	-	ZX1 means settings
	TxBuffer[1] = 88;	// "X"
	TxBuffer[2] = 49;	// "1"
	if (type==1) {
		EE_ReadVariable(addr, &val16);
		TxBuffer[3] = 9;	// packet size. 9 byte for 16bit and 11b for 32bit values
		TxBuffer[4] = RxBuffer[2];
		TxBuffer[5] = RxBuffer[3];
		TxBuffer[6] = (uint8_t)(val16&0xFF);
		TxBuffer[7] = (uint8_t)((val16>>8)&0xFF);
	}
	if (type==2) {
		val32 = EE_ReadWord(addr);
		TxBuffer[3] = 11;	// ZX1+size+4bytepayload+crc
		TxBuffer[4] = RxBuffer[2];
		TxBuffer[5] = RxBuffer[3];
		TxBuffer[6] = (uint8_t)(val32&0xFF);
		TxBuffer[7] = (uint8_t)((val32>>8)&0xFF);
		TxBuffer[8] = (uint8_t)((val32>>16)&0xFF);
		TxBuffer[9] = (uint8_t)((val32>>24)&0xFF);
	}
	TxBuffer[(TxBuffer[3]-1)] = crc_block(0, &TxBuffer[0],(TxBuffer[3]-1));
	NbrOfDataToTransfer = TxBuffer[3];
	TxCounter=0;
	txbuff_ne = 1;
	while (TxCounter<NbrOfDataToTransfer){
		vTaskDelay(1);
	}
	txbuff_ne = 0;
}

void send_ee_block(uint16_t addr){
	uint32_t val32;
	uint8_t i=0, pointer=6;
	// types: 0 - 8 bit, 1 - 16bit, 2 - 32bit
	TxBuffer[0] = 90;	// "Z"	-	ZX1 means settings
	TxBuffer[1] = 88;	// "X"
	TxBuffer[2] = 49;	// "1"
	TxBuffer[3] = 39;	// packet size is 39bytes for settings block of 32b
	TxBuffer[4] = RxBuffer[2];	// start address lower byte
	TxBuffer[5] = RxBuffer[3];	// higher byte
	for (i=0; i<8;i++) {
		val32 = 0;
		val32 = EE_ReadWord(addr+i*2);
		// at this point data converted into bytes - higher first.
		// Note this when convert back on receiving (rx_ee() function)
		TxBuffer[pointer++] = (uint8_t)((val32>>24)&0xFF);
		TxBuffer[pointer++] = (uint8_t)((val32>>16)&0xFF);
		TxBuffer[pointer++] = (uint8_t)((val32>>8)&0xFF);
		TxBuffer[pointer++] = (uint8_t)((val32))&0xFF;
	}

	TxBuffer[pointer] = crc_block(0, &TxBuffer[0],(TxBuffer[3]-1));
	NbrOfDataToTransfer = TxBuffer[3];
	TxCounter=0;
	txbuff_ne = 1;
	while (TxCounter<NbrOfDataToTransfer){
		vTaskDelay(1);
	}
	txbuff_ne = 0;
	tx_flush();

}

void get_settings_block(uint8_t block_number){
	/* block_number is a number from 0 to N, where N is a
	 * Settings memory array length / 8
	 * 8 - is a default block size for this function
	 */
	uint8_t i=0;
	uint16_t addr = 0, tmpbuf = 0;
	TxBuffer[0] = 90;	// Z
	TxBuffer[1] = 88;	// X
	TxBuffer[2] = 49;	// sending settings
	TxBuffer[3] = 42;	// packet size (ZX0+packet_size+payload). Payload is 8bytes. Here, packet size means only payload with size byte, not like in STATUS packets, where size means full packet size
	TxBuffer[4] = block_number;
	for (i=0; i<18; i++) {	// 18 blocks x 2bytes = 36bytes
		// here goes EEPROM reading loop, that puts payload data into TX buff, equipped with appropriate packet header
		addr = SETTINGS_START_ADDR+block_number*18+i*2;	// address for 18 variable (16bit each) block
		EE_ReadVariable(addr, &tmpbuf);	// read 16 bit variable
		TxBuffer[5+i*2] = (uint8_t)(tmpbuf*0xFF00)>>8;	// place it into..
		TxBuffer[5+i*2+1] = (uint8_t)(tmpbuf*0xFF);		// ..two parts
		vTaskDelay(1);
	}
	txbuff_ne=1;	// signal to transmit packet
}

/* void onPacketType(uint8_t b) {
        // depending on packet type we transit to next state
        switch (b) {
        case 1: // for configuration packet type...
            // uint8_t payload[400];
            payloadIdx = 0;
            rxm_state = STATE_CONFIGURATION_PAYLOAD;
            break;
        case 2: // for command packet type...
        	rxm_state = STATE_COMMAND_TYPE; // ...expect command type to be read next
            break;
        }
        crc = 0;
}

void onPayloadByte(uint8_t b, uint8_t nextState) {
         // on each payload byte - fill payload buffer and calculate crc
         payload[payloadIdx++] = b;
         if (payloadIdx == countof(payload)) {
             rxm_state = nextState;
         }
         crc(b);
} */

void get_status_block(uint8_t blockId){	// sends block with Cadi STATUS data
		if (txbuff_ne==0) {
			TxBuffer[0] = 90;	// Z
			TxBuffer[1] = 88;	// X
			TxBuffer[2] = 51;	// 3 (sending STATUS)
			TxBuffer[3] = 40;	// packet size (ZX0+packet_size+payload+crc). Payload is 16bytes
			if (blockId==1) {	// state block 1
				TxBuffer[4] = comm_state;
				TxBuffer[5] = ((uint8_t)(timerStateFlags&0xFF));
				TxBuffer[6] = ((uint8_t)(cTimerStateFlags&0xFF));
				TxBuffer[7] = valveFlags;
				TxBuffer[8] = ((uint8_t)plugStateFlags&0xFF);
				TxBuffer[9] = wpStateFlags;	// watering program run flags
				TxBuffer[10] = dht_data[0];
				TxBuffer[11] = dht_data[1];
				TxBuffer[12] = dht_data[2];
				TxBuffer[13] = dht_data[3];
				TxBuffer[14] = (uint8_t)(RTC->CNTH&(0xFF));	// RTC unixtime
				TxBuffer[15] = (uint8_t)((RTC->CNTH>>8)&(0xFF));
				TxBuffer[16] = (uint8_t)(RTC->CNTL&(0xFF));
				TxBuffer[17] = (uint8_t)(((RTC->CNTL)>>8)&(0xFF));
				TxBuffer[18] = (uint8_t)(sonar_read[FWTANK_SONAR]&(0xFF));		// First sonar lower byte
				TxBuffer[19] = (uint8_t)((sonar_read[FWTANK_SONAR]>>8)&(0xFF));	// first sonar higher byte
				TxBuffer[20] = (uint8_t)(sonar_read[MIXTANK_SONAR]&(0xFF));		// second sonar
				TxBuffer[21] = (uint8_t)((sonar_read[MIXTANK_SONAR]>>8)&(0xFF));
				TxBuffer[22] = (uint8_t)(adcAverage[0]&(0xFF));	// ADC1 average reading
				TxBuffer[23] = (uint8_t)(((adcAverage[0])>>8)&(0xFF));
				TxBuffer[24] = (uint8_t)(adcAverage[1]&(0xFF));	// ADC2 average reading
				TxBuffer[25] = (uint8_t)(((adcAverage[1])>>8)&(0xFF));
				TxBuffer[26] = (uint8_t)(adcAverage[2]&(0xFF));	// ADC3 average reading
				TxBuffer[27] = (uint8_t)(((adcAverage[2])>>8)&(0xFF));
				TxBuffer[28] = (uint8_t)(adcAverage[3]&(0xFF));	// ADC4 average reading
				TxBuffer[29] = (uint8_t)(((adcAverage[3])>>8)&(0xFF));
				TxBuffer[30] = (uint8_t)runners;		// first wfm counter
				TxBuffer[31] = (uint8_t)((water_counter[0]>>8)&(0xFF));
				TxBuffer[32] = (uint8_t)((water_counter[0]>>16)&(0xFF));
				TxBuffer[33] = (uint8_t)((water_counter[0]>>24)&(0xFF));
				TxBuffer[34] = dosingPumpStateFlags2;		// dosing pump flags (dosingPumpStateFlags overwritten by some part of FW)
				TxBuffer[35] = auto_flags;	// first sonar higher byte
				TxBuffer[36] = (uint8_t)wpProgress;		// second sonar
				TxBuffer[37] = (uint8_t)auto_failures;
				TxBuffer[38] = blockId;
			}
			if (blockId==2) {	// state block 2
				TxBuffer[4] = (uint8_t)(psi_pump_top_level&(0xFF));
				TxBuffer[5] = (uint8_t)((psi_pump_top_level>>8)&(0xFF));
				TxBuffer[6] = (uint8_t)(psi_pump_btm_level&(0xFF));
				TxBuffer[7] = (uint8_t)(((psi_pump_btm_level)>>8)&(0xFF));
				TxBuffer[8] = (uint8_t)0;
				TxBuffer[9] = (uint8_t)(((adcAverage[0])>>8)&(0xFF));
				TxBuffer[10] = (uint8_t)(((adcAverage[1])>>0)&(0xFF));
				TxBuffer[11] = (uint8_t)(((adcAverage[1])>>8)&(0xFF));
				TxBuffer[12] = (uint8_t)(((adcAverage[2])>>0)&(0xFF));
				TxBuffer[13] = (uint8_t)(((adcAverage[2])>>8)&(0xFF));
				TxBuffer[38] = blockId;
			}
			if (blockId==3) {	// state block 3
				TxBuffer[4] = (uint8_t)(GPIOA->IDR&(0xFF));
				TxBuffer[5] = (uint8_t)(((GPIOA->IDR)>>8)&(0xFF));
				TxBuffer[6] = (uint8_t)(((GPIOA->IDR)>>16)&(0xFF));
				TxBuffer[7] = (uint8_t)(((GPIOA->IDR)>>24)&(0xFF));
				TxBuffer[8] = (uint8_t)(GPIOB->IDR&(0xFF));
				TxBuffer[9] = (uint8_t)(((GPIOB->IDR)>>8)&(0xFF));
				TxBuffer[10] = (uint8_t)(((GPIOB->IDR)>>16)&(0xFF));
				TxBuffer[11] = (uint8_t)(((GPIOB->IDR)>>24)&(0xFF));
				TxBuffer[12] = dht_data2[2];
				TxBuffer[13] = dht_data2[3];
				TxBuffer[38] = blockId;
			}

			if (blockId==4) {	// state block 4
//				TxBuffer[4] = currentEc;
//				TxBuffer[5] = currentPh;
//				TxBuffer[6] = phUnderOver+ecUnderOver*4;
//				TxBuffer[7] = (uint8_t)(phWindowTop&(0xFF));
//				TxBuffer[8] = (uint8_t)((phWindowBottom>>8)&(0xFF));
				TxBuffer[9] = 00;		// EMPTY
				TxBuffer[10] = dosingPumpStateFlags2;
				TxBuffer[11] = (uint8_t)(wfCalArray[0]&(0xFF));
				TxBuffer[12] = (uint8_t)((wfCalArray[0]>>8)&(0xFF));
				TxBuffer[13] = 77;	// dumb hardcode
				TxBuffer[38] = blockId;
			}

			if (blockId==5) {	// state block 5
				TxBuffer[4] = (uint8_t)(sonar_read[FWTANK_SONAR]&(0xFF));		// First sonar lower byte
				TxBuffer[5] = (uint8_t)((sonar_read[FWTANK_SONAR]>>8)&(0xFF));	// first sonar higher byte
				TxBuffer[6] = (uint8_t)(sonar_read[MIXTANK_SONAR]&(0xFF));		// second sonar
				TxBuffer[7] = (uint8_t)((sonar_read[MIXTANK_SONAR]>>8)&(0xFF));
				TxBuffer[8] = (uint8_t)(water_counter[0]&(0xFF));		// first wfm counter
				TxBuffer[9] = (uint8_t)((water_counter[0]>>8)&(0xFF));
				TxBuffer[10] = (uint8_t)((water_counter[0]>>16)&(0xFF));
				TxBuffer[11] = (uint8_t)((water_counter[0]>>24)&(0xFF));
//				TxBuffer[12] = valve_failed;		//
				TxBuffer[13] = 77;		// dumb hardcode
				TxBuffer[38] = blockId;
			}

			if (blockId==6) {	// block 6
				TxBuffer[4] = (uint8_t)(sonar_read[FWTANK_SONAR]&(0xFF));		// First sonar lower byte
				TxBuffer[5] = (uint8_t)((sonar_read[FWTANK_SONAR]>>8)&(0xFF));	// first sonar higher byte
				TxBuffer[6] = (uint8_t)(sonar_read[MIXTANK_SONAR]&(0xFF));		// second sonar
				TxBuffer[5] = (uint8_t)((sonar_read[MIXTANK_SONAR]>>8)&(0xFF));
				TxBuffer[8] = (uint8_t)(water_counter[1]&(0xFF));		// 2nd water flow meter counter
				TxBuffer[9] = (uint8_t)((water_counter[1]>>8)&(0xFF));
				TxBuffer[10] = (uint8_t)((water_counter[1]>>16)&(0xFF));
				TxBuffer[11] = (uint8_t)((water_counter[1]>>24)&(0xFF));
				TxBuffer[12] = (uint8_t)(wfCalArray[1]&(0xFF));
				TxBuffer[13] = (uint8_t)((wfCalArray[1]>>8)&(0xFF));
				TxBuffer[22] = blockId;
			}
			TxBuffer[(TxBuffer[3]-1)] = crc_block(0, &TxBuffer[0],(TxBuffer[3]-1));	// with crc
			push_tx();
		}
}





void DMA1_Channel4_IRQHandler (void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) { }
}

void DMA1_Channel5_IRQHandler (void)
{

 if(DMA1->ISR & DMA_ISR_TCIF5) { }
}

void bluetooth_init(void){
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

