plantalog/cadi-gcl/stm32f100/grolly/current/main.c
	// Setup Blue & Green LED on STM32-Discovery Board to use PWM.
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;            // Alt Function - Push Pull
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_PinRemapConfig( GPIO_FullRemap_TIM2, ENABLE);        // Map TIM3_CH3 to GPIOC.Pin8, TIM3_CH4 to GPIOC.Pin9

	// Let PWM frequency equal 100Hz.
	// Let period equal 1000. Therefore, timer runs from zero to 1000. Gives 0.1Hz resolution.
	// Solving for prescaler gives 240.
	TIM_TimeBaseStructInit( &TIM_TimeBaseInitStruct );
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV4;
	TIM_TimeBaseInitStruct.TIM_Period = 1000 - 1;   // 0..999
	TIM_TimeBaseInitStruct.TIM_Prescaler = 240 - 1; // Div 240
	TIM_TimeBaseInit( TIM2, &TIM_TimeBaseInitStruct );

	TIM_OCStructInit( &TIM_OCInitStruct );
	TIM_OCInitStruct.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStruct.TIM_OCMode = TIM_OCMode_PWM1;
	// Initial duty cycle equals 0%. Value can range from zero to 1000.
	TIM_OCInitStruct.TIM_Pulse = 0; // 0 .. 1000 (0=Always Off, 1000=Always On)

	TIM_OC3Init( TIM2, &TIM_OCInitStruct ); // Channel 3 Blue LED
	TIM_OC4Init( TIM2, &TIM_OCInitStruct ); // Channel 4 Green LED

	TIM_Cmd(TIM2, ENABLE);
	TIM2->CCR3 = 1000;
	TIM2->CCR4 = 1000;
}

void psi_pwm_test(void){
	uint8_t button = 0;
	uint8_t curpwm = 0;
	while (button!=BUTTON_FWD) {
		button = readButtons();
		vTaskDelay(5);
		if (button==BUTTON_BCK && curpwm>0) {
			curpwm--;
		}
		if (button==BUTTON_OK && curpwm<255) {
			curpwm++;
		}
		TIM2->CCR3 = 1000-curpwm*10;
		TIM2->CCR3 = 1000-curpwm*10;
		Lcd_clear();
		Lcd_write_str("PSI PWM= ");
		Lcd_write_8b(curpwm);
	}
	Lcd_clear();
}



void tankLevelStabSetup(void){
	Lcd_clear();
	uint16_t curlevel=0;
	uint8_t tmp=0;
	Lcd_clear();
	vTaskDelay(10);
	Lcd_clear();
	Lcd_write_str("Set tank top lvl");
	button = 0;
	while (button!=BUTTON_OK) {
		button = readButtons();
		curlevel = sonar_read[FWTANK_SONAR];
		vTaskDelay(5);
		Lcd_goto(1,0);
		Lcd_write_digit(curlevel/100);
		Lcd_write_digit(curlevel);
	}
	vTaskDelay(10);
	EE_WriteVariable(FWTANK_TOP, curlevel);
	printOk();
	vTaskDelay(2000);
	Lcd_write_str("Set btm lvl");
	button = 0;
	Lcd_clear();
	loadSettings();
}

void tankLevelStab(void){
#ifdef TANK_STAB_ENABLE
	vTaskDelay(1);
//	uint16_t tmp=0;
	uint8_t supply_valve=0;
//	EE_ReadVariable(WATER_TANK_SUPPLY_VALVE,&tmp);
	vTaskDelay(1);
//	supply_valve = (uint8_t)(tmp&0x00FF);
	if (((auto_flags&2)>>1)==1) {		// TANK STAB flag 1
			if (sonar_read[FWTANK_SONAR]>(tank_windows_top[FWTANK]+2)) {
				open_valve(WI_VALVE);
			}
			vTaskDelay(1);
			if (sonar_read[FWTANK_SONAR]<tank_windows_top[FWTANK]) {
				close_valve(WI_VALVE);
			}
	}
#endif
}




void open_valve(uint8_t valveId){
	if (valveId==0) {
		VALVE_CTRL_PORT->BRR |= (1<<8);			// valveId=0 is FWI valve
	}
	else {
		VALVE_CTRL_PORT->BRR |= (1<<(valveId+10));	// 10 - shift for PA11 for valve 1
	}
	valveFlags |= (1<<valveId); // set flag
}

void close_valve(uint8_t valveId){
	if (valveId==0) {
		VALVE_CTRL_PORT->BSRR |= (1<<8);			// valveId=0 is FWI valve
	}
	else {
		VALVE_CTRL_PORT->BSRR |= (1<<valveId+10);	// 10 - shift for PA11 as valve 1
	}
	valveFlags &= ~(1<<valveId); // reset flag
}


void EXTI0_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line0);
#ifdef WFM_PINS_PB0_1	// water flow meter (WFM) driver actions
	water_counter[0]++;
#endif
}

void EXTI1_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line1);
#ifdef WFM_PINS_PB0_1
	water_counter[1]++;
#endif

}

void EXTI2_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line2);

}

void EXTI15_10_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line10);
	EXTI_ClearITPendingBit(EXTI_Line11);
	EXTI_ClearITPendingBit(EXTI_Line12);
}

void EXTI9_5_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line5);
	EXTI_ClearITPendingBit(EXTI_Line6);
	EXTI_ClearITPendingBit(EXTI_Line7);
}

void eeprom_test(void){
	uint16_t addr=1500;
	uint16_t val=0;
	button = 0;
	while (button!=BUTTON_FWD) {
		button=readButtons();
		val = 0;
		EE_ReadVariable(addr, &val);

		vTaskDelay(5);
		Lcd_clear();
		Lcd_write_str("Addr: ");
		Lcd_write_16b(addr);
		Lcd_goto(1,0);
		Lcd_write_str("Val: ");
		Lcd_write_16b(val);
		if (button==BUTTON_OK){
			if (addr<2000) {
				addr++;
			}
			else {
				addr=1400;
			}
		}
		if (button==BUTTON_BCK){
			if (addr>1400) {
				addr--;
			}
			else {
				addr=2000;
			}
		}
		vTaskDelay(25);
	}
}

void valve_test2(void){
	vTaskDelay(5);
	uint8_t curvalve=0;
	Lcd_clear();
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		Lcd_write_str("curvalve:");
		Lcd_write_digit(curvalve);



		if (button==BUTTON_FWD){
			//open_valve(curvalve);
			open_valve(curvalve);
		}
		if (button==BUTTON_CNL){
			//close_valve(curvalve);
			close_valve(curvalve);
		}
		if (button==BUTTON_BCK){
			if (curvalve<2) {
				curvalve++;
			}
			else {
				curvalve=0;
			}
		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_str("VF");
		Lcd_write_digit(valveFlags);

		vTaskDelay(1);

		Lcd_write_str("States:");

		if (VALVE_SENSOR_PORT->IDR&(1<<4)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		if (VALVE_SENSOR_PORT->IDR&(1<<5)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");

		if (VALVE_SENSOR_PORT->IDR&(1<<6)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR&(1<<8)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		}

#endif
	}
	Lcd_clear();
}

void valve_test3(void){
	uint8_t curvalve=2;
	Lcd_clear();

	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		Lcd_write_str("curvalve:");
		Lcd_write_digit(curvalve);
		if (button==BUTTON_FWD){
			//open_valve(curvalve);
			VALVE_CTRL_PORT->BSRR |= (1<<(11+curvalve));
		}
		if (button==BUTTON_CNL){
			//close_valve(curvalve);
			VALVE_CTRL_PORT->BRR |= (1<<(11+curvalve));
		}
		if (button==BUTTON_BCK){
			if (curvalve<4) {
				curvalve++;
			}
			else {
				curvalve=2;
			}
		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_str("VF");
		Lcd_write_digit(valveFlags);

