plantalog/cadi-gcl/stm32f100/grolly/current/main.c
		vTaskDelay(1);

		Lcd_write_str("States:");

		if (GPIOA->ODR&(1<<13)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
		if (GPIOA->ODR&(1<<14)) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

#endif
	}
	Lcd_clear();
}


void valve_test(void){
	uint16_t tmp=0;
	Lcd_clear();
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);

		tmp=sonar_read[FWTANK_SONAR];
		Lcd_write_digit(tmp);
		tmp=sonar_read[MIXTANK_SONAR];
		Lcd_write_digit(tmp);
		Lcd_write_str("cm");

		tmp=TIM17->CNT;
		Lcd_write_16b(tmp);

			if (button==BUTTON_FWD){
						open_valve(1);
			}
			if (button==BUTTON_BCK){
					close_valve(1);
			}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_digit(valveFlags);
		Lcd_write_str("VS");
		uint16_t val=0;
		val = VALVE_SENSOR_PORT->IDR>>5;
		Lcd_write_16b(val);
		Lcd_write_str(" ");

		vTaskDelay(1);
		if (VALVE_SENSOR_PORT->IDR>>5 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>6 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>7 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
#endif

		Lcd_write_str("W");

	}
	psi_pwm_test();
	eeprom_test();
	Lcd_clear();
	valve_test2();
	valve_test3();
}





uint16_t adjustFlags(uint16_t flags, uint8_t from, uint8_t to){
	uint8_t i=0;
	uint8_t cursor=0;
	uint8_t var=0;
	var = (flags>>from);
	Lcd_goto(0,0);
	Lcd_write_str("_");
	button=0;
	while (button!=BUTTON_OK) {
		button=readButtons();
		Lcd_goto(1,0);
		for (i=0;i<(to-from);i++) {
			if ((var>>i)&1==0){
				Lcd_write_str("0");
			}
			else {
				Lcd_write_str("1");
			}
		}
		vTaskDelay(1);
		for (i=0;i<(to-from);i++) {
			Lcd_goto(0,0);
			Lcd_write_str(" ");
		}
		Lcd_goto(0, cursor);
		Lcd_write_str("_");
		vTaskDelay(5);
		if (button==BUTTON_FWD && cursor<(to-from)) {
			cursor++;
		}
		if (button==BUTTON_BCK && cursor>0) {
			cursor--;
		}
		if (button==BUTTON_CNL){
			// invert current cursor positioned bit
			var ^= (1 << cursor);
		}
	}
	// put temporary var back into flags
	for (i=0; i<(to-from); i++) {
		if ((var>>i)&1==1) {
			flags|=(1<i+from);	// set bit
		}
		else {
			flags &= ~(1<<(i+from)); // reset bit
		}
	}
	printOk();
	return flags;
}

void water_program_setup(uint8_t progId){
	uint16_t addr=0, volume=0, flags=0;
	uint32_t time=0;

	// setting water volume
	Lcd_clear();
	Lcd_write_str("Volume");		// in sonar distance units
	vTaskDelay(200);
	addr = WP_OFFSET+progId*WP_SIZE+WP_VOLUME;
	EE_ReadVariable(addr, &volume);
	volume = (uint16_t)adjust8bit(volume);
	EE_WriteVariable(addr, volume);

	// setting watering lines valves to open
	Lcd_clear();
	Lcd_goto(0,5);
	Lcd_write_str("ON VALVES");		// in sonar distance units
	vTaskDelay(200);
	addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
	EE_ReadVariable(addr, &flags);
	flags = adjustFlags(flags,0,3);
	uint8_t flag = 0;
	while (button==0) {
		button=readButtons();
		if (button==BUTTON_FWD){
			flag = 1 - flag;
		}
		vTaskDelay(25);
	}
	if (flag==1) {
		flags|=1;	// set bit
	}
	else {
		flags &= ~1; // reset bit
	}
	EE_WriteVariable(addr, flags);
	vTaskDelay(5);
	printOk();

	// adjust start time
	uint32_t ts=0;		// timestamp unixtime
	addr = WP_OFFSET+progId*WP_SIZE+WP_START;
	ts = EE_ReadWord(addr);
	ts = timeAdjust(ts,1);
	EE_WriteVariable(addr, ts);

	// adjust end time
	addr = WP_OFFSET+progId*WP_SIZE+WP_END;
	ts = EE_ReadWord(addr);
	ts = timeAdjust(ts,1);
	EE_WriteVariable(addr, ts);

	// adjust interval
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
	ts = EE_ReadWord(addr);
	ts = CTimerAdjust(ts);
	EE_WriteWord(addr, ts);

}



void fertilization_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	fertilizer_mixing_program_setup(progId);
}

void watering_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	water_program_setup(progId);
}

// set fertilizer mixing programs
void fertilizer_mixing_program_setup(uint8_t progId){
	uint16_t addr=0, tempvalue=0;

	// choose dosing pump to use
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Fertilizer 2 use");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set dosing time, seconds
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Dosing duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump mixing time
//	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Aftermix time");		// setting the time for running circulation pump to mix the fertilizer into solution
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering program to associate this fertilizer mix program with
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Link to WP");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set frequency (N), showing how often this fertilizer mixing program activates (every N watering program run)
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Trig. freq. N");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set ENABLED/DISABLED status for this program
//	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_ENABLE;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("ENABLE FMP?");
	tempvalue = adjust16bit(tempvalue);
	vTaskDelay(10);
	EE_WriteVariable(addr, tempvalue);
	Lcd_clear();
	vTaskDelay(10);
	loadSettings();
}

void startWp(void){
	uint8_t progId=0, button=0;
	uint32_t addr, tmp32, interval;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	Lcd_clear();
	Lcd_write_str("Start WP#");
	Lcd_write_digit(progId);
	Lcd_write_str("?");
	button=0;
	while (button!=BUTTON_OK && button!=BUTTON_CNL) {
//		dht_get_data();
		vTaskDelay(30);
		button=readButtons();
	}
	vTaskDelay(200);
	if (button==BUTTON_OK) {
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
		interval = EE_ReadWord(addr);
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

