plantalog/cadi-gcl/stm32f100/grolly/current/main.c
		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	Lcd_clear();
	vTaskDelay(200);
}







/*
 * This Watering Program has following strategy:
 * - the mixing tank is always empty before watering program starts
 * - the watering solution volume is fixed for each watering
 * - water intaken by opening FWI valve (for Grolly ID 4)
 * - MIXTANK_SONAR is used for measuring distance to water edge,
 *  from the top of the tank where sonar installed
 *
 */



void run_watering_program(uint8_t progId){

	wpProgress = 2;
	wpStateFlags|=(1<<progId);	// set active flag for this program
	uint32_t wpStartTs = 0;
	wpStartTs = RTC_GetCounter();
	// FRESH WATER INTAKE
	open_valve(FWI_VALVE);	// FWI valve
	wpProgress = 3;
	volatile uint16_t n=0;
	uint8_t i=0;
	uint32_t curN=0;
	uint32_t interval=0;
	uint32_t startime=0;
	uint32_t now=0;
	uint32_t overTime=4000000000;
	uint16_t fwl=0;
	uint16_t swl = 0;
	uint16_t curprcnt = 0;
	uint16_t volume = 0;
	uint16_t addr=0;
	uint16_t fmpLink=0;
	uint16_t flags=0;
	uint16_t curLvl = 0;
	uint8_t got_fw = 0;
	uint8_t ninetenth=0;
	now = RTC_GetCounter();
	startime = now;
	wpProgress = 4;
	vTaskDelay(100);
	/*
	 *  Filling water strategy A
	 *   The water is filled up in amount of 'volume',
	 *    when there is less than 100% of watering program volume currently
	 *    in the MIXTANK. This behavior expects already prepared solution in
	 *    the MIXTANK, suitable for this (any, that could run) watering
	 *    program
	 *    swl - start water level
	 *    fwl - final water level
	 *
	 *    !!! REMEMBER !!!
	 *    More sonar read value, less water in the tank!
	 */
	swl = sonar_read[MIXTANK_SONAR];			// remember start water level
	addr = WP_OFFSET+progId*WP_SIZE+WP_VOLUME;	// read the volume needed to add in MIXTANK
	EE_ReadVariable(addr, &volume);
	vTaskDelay(100);
	volume &= (uint16_t)0xFF;	// lower byte - WP volume, higher - WP rules
	fwl = tank_windows_bottom[MIXTANK] - swl;	// how much water we have already
	uint8_t left = 0;							// indicates how much water let to fill
	if (fwl < volume) {							// if < than WP volume
		fwl = swl - volume;						// get Final Water Level: now+WPvol
		while (overTime > now) { // 5 seconds sonar should report >100% fill to close FWI valve
			left = (uint8_t)(sonar_read[MIXTANK_SONAR] - fwl);
			if ( sonar_read[MIXTANK_SONAR] >= fwl){	// more sonar read - less water
				overTime = now + 5;
				open_valve(FWI_VALVE);
			}
			Lcd_goto(0,9);
			Lcd_write_str("Left=");
			Lcd_write_8b(left);
			vTaskDelay(250);
			now = RTC_GetCounter();
			wpProgress = 5;
		}
		close_valve(FWI_VALVE);
		vTaskDelay(1000);
		wpProgress = 6;

		// mix fertilizers
		got_fw = (uint8_t)swl - (uint8_t)sonar_read[MIXTANK_SONAR];
		ninetenth = (uint8_t)((volume*9)/10);

		for (i=0; i<FMP_PROGRAMS_AMOUNT; i++) {
			wpProgress = i+87;
			addr=0;
			// count current N value
			addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
			interval = EE_ReadWord(addr);
			addr = WP_OFFSET+progId*WP_SIZE+WP_START;
			startime = EE_ReadWord(addr);
			vTaskDelay(100);
			addr = FMP_OFFSET+i*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
			EE_ReadVariable(addr, &n);
			curN = (RTC_GetCounter()-startime)/interval;
			vTaskDelay(100);
			wpProgress = 200;
			vTaskDelay(200);
			uint8_t rest = curN%(n%256);	// lower byte of 16bit of FMP_TRIG_FREQUENCY_SHIFT
			uint16_t enabled=0;
			fmpLink=n/256;	// higher byte of FMP_TRIG_FREQUENCY = WP link
			addr = 0;
			addr = FMP_OFFSET+i*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
			EE_ReadVariable(addr, &enabled);
			if (fmpLink==progId && enabled>0 && rest==0) {
				wpProgress = 99;
				vTaskDelay(400);
				run_fertilizer_mixer(i);
				wpProgress = 100+i;
				vTaskDelay(2000);
			}
			vTaskDelay(100);
			wpProgress = 8;
		}
	}
	vTaskDelay(50);
	wpProgress = 9;
	// open corresponding watering line valve(s)
	addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
	EE_ReadVariable(addr, &flags);
	for (i=1; i<=VALVE_AMOUNT; i++) {
		if (((flags>>i)&1)==1) {
			open_valve(i);
		}
		else {
			close_valve(i);
		}
		vTaskDelay(100);
	}
	wpProgress = 10;
	// run watering
	auto_flags|=9;	// enable watering through psi stab function with underpressure trig
	uint8_t srcomm = 0;
	uint16_t tmpval=0;
	srcomm = comm_state;	// backup curent commstate. to recover after watering
	comm_state = COMM_MONITOR_MODE;
	vTaskDelay(50);
	addr = WP_OFFSET+progId*WP_SIZE;
	volume=0;
	EE_ReadVariable(addr, &volume);
	overTime = RTC_GetCounter() + volume;	// volume used to retrieve timeout
	auto_failures  &= ~1;	// reset PSI main failure flag
	auto_failures  &= ~(1<<3);	// reset PSI underpressure flag
	while (((auto_failures&8)>>3)==0 && now<overTime) {
		vTaskDelay(500);
		wpProgress = overTime-now;
		now=RTC_GetCounter();
	}
	wpProgress = 12;
	vTaskDelay(20000);	// release pressure in watering line
	auto_flags&=~(1);	// disable PSI stab function flag
	plugStateSet(PSI_PUMP_ID, 0);	// force disable PSI pump
	comm_state = srcomm;	// recover comm_state
	auto_failures  &= ~(1<<3);	// reset PSI failure flag
	wpProgress = 13;
	vTaskDelay(1000);
	valve_init();	// close all valves

	addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
	EE_WriteWord(addr, wpStartTs);	// write last run time

	wpStateFlags &= ~(1<<progId); // sbrosit' flag
	vTaskDelay(200);
}

void run_fertilizer_mixer(uint8_t progId){
	uint16_t dosingTime, dosingPumpId, circulationMixingTime, addr;
	uint32_t dosingEndTime=0;

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &dosingTime);

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &dosingPumpId);
	wpProgress = 95;
	vTaskDelay(400);
	addr = 0;
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_AFTERMIX_TIME_SHIFT;
	wpProgress = 94;
	vTaskDelay(400);
	EE_ReadVariable(addr, &circulationMixingTime);
	wpProgress = 93;
	vTaskDelay(400);
	dosingEndTime = RTC_GetCounter()+(uint32_t)dosingTime;
	wpProgress = 92;
	vTaskDelay(400);
	enable_dosing_pump(dosingPumpId, 101);
	wpProgress = 91;
	vTaskDelay(400);
	while (RTC_GetCounter()<dosingEndTime) {
		wpProgress = 91;
		vTaskDelay(100);
	}
	wpProgress = 90;
	vTaskDelay(400);
	enable_dosing_pump(dosingPumpId, 0);
	wpProgress = 89;
	vTaskDelay(400);
	run_circulation_pump(circulationMixingTime);
}

