plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void run_circulation_pump(uint16_t time){
	uint32_t endTime=0;
	endTime = RTC_GetCounter()+time;
	enable_dosing_pump(MIXING_PUMP,1);	// Grolly has Mixing pump connected to T8 MOSFET of Cadi MB 1402
	close_valve(FWI_VALVE);
	while (RTC_GetCounter()<endTime) {
		vTaskDelay(10);
		enable_dosing_pump(MIXING_PUMP,1);
	}
	enable_dosing_pump(MIXING_PUMP,0);
}


void enable_dosing_pump2(uint8_t pumpId, uint8_t state){
	if (state==1) {
		dosingPumpStateFlags |= (1<<pumpId);
	}
	else {
		dosingPumpStateFlags &= ~(1<<pumpId);
	}

	state = 1-state;	// 0% pwm means running motor

	if (pumpId==0) {
		TIM3->CCR1 = state*1000;
	}
	if (pumpId==1) {
		TIM3->CCR2 = state*1000;
	}
	if (pumpId==2) {
		TIM3->CCR3 = state*1000;
	}
	if (pumpId==3) {
		TIM3->CCR4 = state*1000;
	}
}

void enable_dosing_pump(uint8_t pumpId, uint8_t state){
	uint16_t prcnt = 0;
	if (state>0) {
		dosingPumpStateFlags2 |= (1<<pumpId);
	}
	else {
		dosingPumpStateFlags2 &= ~(1<<pumpId);
	}

	if (state==1) {
		state = 0;
	}
	else if (state==101) {		// run doser respecting eeprom programmed speeds
		EE_ReadVariable(DOSER_SPEEDS, &prcnt);
		vTaskDelay(2);
		state = (uint8_t)(prcnt&0xFF);
	}
	else {
		state = 100 - state;	// 0 - running motor, 100 - stopped
	}

	if (pumpId==0) {
		TIM3->CCR1 = state*10;
	}
	if (pumpId==1) {
		TIM3->CCR2 = state*10;
	}
	if (pumpId==2) {
		TIM3->CCR3 = state*10;
	}
	if (pumpId==3) {
		TIM3->CCR4 = state*10;
	}
}

void get_fertilizer(uint8_t fertId, uint8_t secs){	// secs - number of seconds to run the fertId pump
	uint32_t reach = 0;
	// to make counting more precise wait until the next second STARTS
	reach = RTC_GetCounter()+1;
	while (RTC_GetCounter()<reach) {
		vTaskDelay(2);
	}
	reach = RTC_GetCounter()+secs;
	enable_dosing_pump(fertId,1);	// enable dosing pump
	while (RTC_GetCounter()<reach) {	// now dose the fertilizer withi 'secs' seconds
		vTaskDelay(2);		//
	}
	enable_dosing_pump(fertId,0);
}

void valve_init(void){
	close_valve(3);
	close_valve(4);
	close_valve(0);
	close_valve(1);
	close_valve(2);
}

void watering_program_trigger(void *pvParameters){
	uint32_t curtime=0;
	uint32_t lastRun=0;
	uint32_t interval=0;
	uint32_t diff=0;
	uint32_t startTime=0;
	uint32_t endTime=0;
	uint16_t addr=0;
	uint16_t temp=0;
	uint8_t wpStateFlag=0;
	uint8_t progId=0;
	uint8_t enabled=0;
	uint8_t rules=0;
	// close all valves
	valve_init();
	vTaskDelay(20000);
	while (1) {

		// main loop
		for (progId=0; progId<WP_AMOUNT; progId++){
			vTaskDelay(10);
			addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
			lastRun = EE_ReadWord(addr);
			curtime = RTC_GetCounter();
			addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL;
			interval = EE_ReadWord(addr);
			diff = curtime-lastRun;
			addr = WP_OFFSET+progId*WP_SIZE+WP_START;
			startTime = EE_ReadWord(addr);	// program start time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_END;
			endTime = EE_ReadWord(addr);	// program end time point
			vTaskDelay(50);
			addr = WP_OFFSET+progId*WP_SIZE+WP_VOLUME;	// read the volume needed to add in MIXTANK
			EE_ReadVariable(addr, &temp);
			rules = (uint8_t)((temp>>8)&0xFF);	// get timer rules applied to WP
			vTaskDelay(50);
			enabled = rules&((uint8_t)(timerStateFlags&0xFF));
			if (enabled>0) {	// if any of the timer rules OK, enable WP
				rules = 1;
			}
			else {
				rules = 0;
			}
			vTaskDelay(20);
			enabled = 0;
			addr = WP_OFFSET+progId*WP_SIZE+WP_FLAGS;
			temp = 0;
			EE_ReadVariable(addr, &temp);	// program start time point
			vTaskDelay(500);
	//		Lcd_goto(0,9);
	//		Lcd_write_8b(rules);
			vTaskDelay(500);
			enabled = (uint8_t)(temp&0xFF);
			if (diff>interval && curtime>startTime && curtime<endTime && enabled>0 && rules==1){
				run_watering_program(progId);
				// wpProgress++;
			}
			vTaskDelay(50);
		}
	}

}




void dht_init(void){
	// RCC Config
	  /* TIM15 clock enable */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);

	  // GPIO Config
	  GPIO_InitTypeDef GPIO_InitStructure;

	  /* TIM15 channel 2 pin (PB15) configuration */
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	// NVIC Config

	  GPIO_PinRemapConfig(GPIO_Remap_TIM15, ENABLE);
	  NVIC_InitTypeDef NVIC_InitStructure;

	   /* Enable the TIM15 global Interrupt */

	  NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_TIM15_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);

	   TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	   TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	   TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	   TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	   TIM_ICInitStructure.TIM_ICFilter = 0x0;

	   TIM_PWMIConfig(TIM15, &TIM_ICInitStructure);

	   /* Select the TIM15 Input Trigger: TI2FP2 */
	   TIM_SelectInputTrigger(TIM15, TIM_TS_TI2FP2);

	   /* Select the slave Mode: Reset Mode */
	   TIM_SelectSlaveMode(TIM15, TIM_SlaveMode_Reset);

	   /* Enable the Master/Slave Mode */
	   TIM_SelectMasterSlaveMode(TIM15, TIM_MasterSlaveMode_Enable);

	   /* TIM enable counter */
	   TIM_Cmd(TIM15, ENABLE);

	   /* Enable the CC2 Interrupt Request */
	   TIM_ITConfig(TIM15, TIM_IT_CC2, ENABLE);

}

void dht_init_out(void){	// init GPIO pin as OUTput
	 GPIOB->CRH      &= ~GPIO_CRH_CNF15;		// ... and PB15 for DHT triggering
     GPIOB->CRH   |= GPIO_CRH_MODE15_0;
}

/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM_GetCapture2(TIM3);

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = (TIM_GetCapture1(TIM3) * 100) / IC2Value;

