plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void Lcd_write_32int(uint32_t d){
	char tmpstr[10];
	int32str(d, &tmpstr);
	copy_arr(&tmpstr, LCDLine2, 11, 0);
}



/* void enablePlug5ms(uint8_t plug, uint16_t amount){	// 1 amount = 5ms
	 RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;   //enable TIM2 clock
	 TIM2->PSC     = 40000-1;               //set divider for 5 milliseconds
	 TIM2->ARR = amount;
	 TIM2->CR1     = TIM_CR1_OPM;          //one pulse mode
	 TIM2->CR1 |= TIM_CR1_CEN;
	 plugStateSet(plug, 1);
	 while((TIM2->SR & TIM_SR_UIF)==0){
		 vTaskDelay(10);
	 }
	 plugStateSet(plug, 0);
}
*/

uint32_t measureDelay(void){	// maximum 300+ (65535/200) seconds
	 RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;   //enable TIM2 clock
	 TIM2->PSC     = 40000-1;               //set divider for 5 milliseconds
	 TIM2->CR1     = TIM_CR1_OPM;          //one pulse mode
	 TIM2->CR1 |= TIM_CR1_CEN;
	button=0;
	 while (button!=BUTTON_OK) {
		 button = readButtons();
		 // display counter value
		 Lcd_goto(1,0);
		 Lcd_write_16int(TIM2->CNT);
	 }
	 return TIM2->CNT;
}



typedef struct
{
    uint32_t quot;
    uint8_t rem;
} divmod10_t;


#define MENURECS	34

#ifndef TEST_MODE
// menu items
const char menuItemArray[MENURECS][18]=
{
		{"MONITOR MODE"},		// 0
		{"TIMERS"},				// 1
		{"Timer 1"},			// 2
		{"Timer 2"},			// 3
		{"Timer 3"},			// 4
		{"SET CLOCK"},			// 5
		{"CYCLIC TIMERS"},			// 6
		{"C Timer 1"},			// 7
		{"C Timer 2"},			// 8
		{"C Timer 3"},			// 9
		{"PLUG SETTINGS"},			// 10
		{"Plug 1"},			// 11
		{"Plug 2"},			// 12
		{"Plug 3"},			// 13
		{"pH-monitor"},		// 14
		{"Calibration"},	// 15
		{"pH-stabilizer"},	// 16

		{"EC-monitor"},		// 17
		{"Calibration"},	// 18
		{"EC-stabilizer"},	// 19

		{"DAYLIGHT SENSOR"},// 20
		{"   "},	// 21
		{"Keeping window"},	// 22
		{"Get water"},	// 23
		{"Add Light"},	// 24
		{"Temp. & humidity"},	// 25
		{"Hygrostat"},	// 26
		{"Thermostat"},	// 27
		{"Valve test"},	// 28
		{"Watering progs"},	// 29
		{"Fertilization"},	// 30
		{"Button test"},	// 31
		{"pH&EC test"},	// 32
		{"Start watering"}	// 33

};

// 0 - nr zapisi, 1 - link na tekst, 2 - <, 3 - >, 4 - OK, 5 - CNCL, 6 - tip zapisi (0 - folder, 1 - program)
const uint8_t fatArray[MENURECS][7]=
{
		{0,	0,	33,	1,	1,	0,	1},
		{1,	1,	0,	5,	2,	1,	1},
		{2,	2,	4,	3,	2,	1,	1},
		{3,	3,	2,	4,	3,	1,	1},
		{4,	4,	3,	2,	4,	1,	1},
		{5,	5,	1,	6,	5,	5,	1},
		{6,	6,	5,	10,	7,	6,	0},
		{7,	7,	9,	8,	6,	6,	1},
		{8,	8,	7,	9,	7,	6,	1},
		{9,	9,	8,	7,	8,	6,	1},
		{10,10,	6,	14,	11,	10,	0},
		{11,11,	13,	12,	9,	10,	1},
		{12,12,	11,	13,	10,	10,	1},
		{13,13,	12,	11,	11,	10,	1},
		{14,14,	10,	17,	15,	14,	0},
		{15,15,	16,	16,	15,	14,	1},
		{16,16,	15,	15,	16,	14,	1},
		{17,17,	14,	20,	18,	17,	0},
		{18,18,	19,	19,	23,	17,	1},	// ec calibration
		{19,19,	18,	18,	24,	17,	1},	// ec stab settings




		{20,20,	17,	21,	14,	17,	1},	// daylight sensor
		{21,21,	20,	25,	22,	18,	0},	// combi timers
		{22,22,	24,	23,	15,	22,	1},	// Tank level Keeping window setup
		{23,23,	22,	24,	16,	23,	1},	// t+2ct
		{24,24,	23,	22,	17,	24,	1},	// add light
		{25,25,	21,	26,	17,	25,	1},	// temp and humidity
		{26,26,	25,	27,	18,	26,	1},	// hygrostat
		{27,27,	26,	28,	19,	27,	1},	// thermostat
		{28,28,	27,	29,	20,	28,	1},	// valve test
		{29,29,	28,	30,	21,	29,	1},	// watering progs
		{30,30,	29,	31,	22,	30,	1},	// fertilization
		{31,31,	30,	32,	25,	31,	1},	// button test
		{32,32,	31,	33,	26,	32,	1},	// pH and ec test
		{33,33,	32,	0,	27,	33,	1}	// test function

};

#endif

#ifdef TEST_MODE
// menu items

/*
 * *
 * |-MONITOR MODE 			/ 0
 * |-TESTS					/ 1
 * |	|-Valves			/ 2
 * |	|-Temp&Humidity		/ 3
 * |	|-EEPROM			/ 4
 * |	|-Plugs				/ 5
 * |	|-Dosers			/ 6
 * |	|-rest				/ 7
 * |-TIMERS					/ 8
 * |	|-24H/Full Range	/ 9
 * |	|-Cyclic			/ 10
 * |-STABILIZERS			/ 11
 * |	|-CO2				/ 12
 * |	|-Pressure			/ 13
 * |	|-Tank levels		/ 14
 * |	|-Temperature		/ 15
 * |	|-Humidity			/ 16
 * |	|-pH				/ 17
 * |-SETTINGS				/ 18
 * |	|-Dosers			/ 19
 * |	|-Plug settings		/ 20
 * |	|-Set clock			/ 21
 * |-WATERING				/ 22
 * |	|-Watering progs	/ 23
 * |	|-Fertilization		/ 24
 */

const char menuItemArray[MENURECS][18]=
{
		{"MONITOR MODE"},		// 0
		{"TESTS"},				// 1
			{"Valves"},	    		// 2
			{"Temp&Humidity"},			// 3
			{"EEPROM"},			// 4
			{"Plugs"},			// 5
			{"Dosers"},			// 6
			{"rest"},			// 7
		{"TIMERS"},			// 8
			{"24h / Full range"},	// 9
			{"Cyclic"},			// 10
		{"STABILIZERS"},			// 11
			{"CO2"},			// 12
			{"Pressure"},			// 13
			{"Tank levels"},		// 14
			{"Temperature"},	// 15
			{"Humidity"},	// 16
			{"pH"},		// 17
		{"SETTINGS"},	// 18
			{"Dosers"},	// 19
			{"Plugs"},// 20
			{"Set clock"},// 21
		{"WATERING"},// 22
			{"Watering progs"},// 23
			{"Fertilization"}// 24

};

/*
const char menuItemArray[MENURECS][18]=
{
		{"MONITOR MODE"},		// 0
		{"TIMERS"},				// 1
		{"Tests"},	    		// 2
		{"Plug test"},			// 3
		{"PSI sensor cal."},			// 4
		{"SET CLOCK"},			// 5
		{"CYCLIC TIMERS"},			// 6
		{"C Timer 1"},			// 7
		{"C Timer 2"},			// 8
		{"C Timer 3"},			// 9
		{"PLUG SETTINGS"},			// 10
		{"Plug 1"},			// 11
		{"Plug 2"},			// 12
		{"Plug 3"},			// 13
		{"pH-monitor"},		// 14
		{"Calibration"},	// 15
		{"CO2-stabilizer"},	// 16

		{"EC-monitor"},		// 17
		{"Calibration"},	// 18
		{"EC-stabilizer"},	// 19

		{"DAYLIGHT SENSOR"},// 20
		{"Tank lvl keeper"},	// 21
		{"Keeper window"},	// 22
		{"Tank tests"},	// 23
		{"Add Light"},	// 24
		{"Temp. & humidity"},	// 25
		{"Hygrostat"},	// 26
		{"Thermostat"},	// 27
		{"Valve test"},	// 28
		{"Watering progs"},	// 29
		{"Fertilization"},	// 30
		{"Button test"},	// 31
		{"pH&EC test"},	// 32
		{"Start watering"}	// 33

};
*/


// 0 - nr zapisi, 1 - link na tekst, 2 - <, 3 - >, 4 - OK, 5 - CNCL, 6 - tip zapisi (0 - folder, 1 - program)
const uint8_t fatArray[MENURECS][7]=
{
		{0,	0,	22,	1,	1,	0,	1},		// MONITOR MODE
		{1,	1,	0,	8,	2,	1,	0},		// TESTS
			{2,	2,	7,	3,	2,	1,	1},		// Valves
			{3,	3,	2,	4,	3,	1,	1},		// Temp and Humidity
			{4,	4,	3,	5,	4,	1,	1},		// EEPROM
			{5,	5,	4,	6,	5,	1,	1},		// Dosers
			{6,	6,	5,	7,	7,	1,	1},		// Plugs
			{7,	7,	7,	2,	6,	1,	1},		// Rest
		{8,	8,	1,	11,	9,	8,	0},		// TIMERS
			{9,	9,	10,	10,	8,	8,	1},		// 24H/Full range
			{10,10,	9,	9,	9,	8,	1},		// Cyclic
		{11,11,	8,	18,	12,	11,	0},		// STABILIZERS
			{12,12,	17,	13,	10,	11,	1},		// CO2
			{13,13,	12,	14,	11,	11,	1},		// Pressure
			{14,14,	13,	15,	15,	11,	0},		// Tank levels
			{15,15,	14,	16,	15,	11,	1},		// Temperature
			{16,16,	15,	17,	16,	11,	1},		// Humidity
			{17,17,	16,	12,	18,	11,	0},		// pH
		{18,18,	11,	22,	19,	18,	0},		// SETTINGS
			{19,19,	21,	20,	24,	18,	1},		// Dosers
			{20,20,	19,	21,	14,	18,	1},		// Plugs
			{21,21,	20,	19,	14,	18,	1},		// Plugs
		{22,22,	18,	0,	23,	18,	0},		// WATERING
			{23,23,	24,	24,	28,	22,	1},	// Watering progs
			{24,24,	23,	23,	23,	22,	1}	// Fertilization
};

#endif

char* adc2str(uint_fast16_t d, volatile char* out)
{
	char out2[17];
	uint8_t i, k, c;
    out2[16] = '\0';
    out2[15] = '0' + ( d       )    % 10;
    out2[14] = '0' + ( d /= 10 )    % 10;
    out2[13] = '0' + ( d /= 10 )    % 10;
    out2[12] = '0' + ( d /= 10 )    % 10;
    out2[11] = '0' + ( d /= 10 )    % 10;
    out2[10] = '0' + ( d /= 10 )    % 10;
    vTaskDelay(25);
    out2[9] = '0' + ( d /= 10 )    % 10;
    out2[8] = '0' + ( d /= 10 )    % 10;
    out2[7] = '0' + ( d /= 10 )    % 10;
    out2[6] = '0' + ( d /= 10 )    % 10;
    out2[5] = '0' + ( d /= 10 )    % 10;
    out2[4] = '0' + ( d /= 10 )    % 10;
    out2[3] = '0' + ( d /= 10 )    % 10;
    out2[2] = '0' + ( d /= 10 )    % 10;
    out2[1] = '0' + ( d /= 10 )    % 10;
    out2[0] = '0' + ( d /  10 )    % 10;
    k=0;
    c=out2[k];
    c=48;

	vTaskDelay(25);
	while (c==48){
    	k++;
    	c=out2[k];
	}
	vTaskDelay(25);
	for (i=k; i<17; i++){
		out[i-k]=out2[i];
	}

    return out;
}

