plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void display_usart_rx(void){
		uint8_t i=0;
		Lcd_clear();
		vTaskDelay(500);
		button=0;
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(RxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(RxBuffer[5]);
			Lcd_write_8b(RxBuffer[6]);
			Lcd_write_str(" ");
			Lcd_write_digit(prefixDetectionIdx);
			Lcd_write_digit(pb_pntr);
//			copy_arr(&RxBuffer, &LCDLine2, 5,11);
			vTaskDelay(20);
		}
		Lcd_clear();
}

void display_usart_tx(void){
		uint8_t i=0;
		Lcd_clear();
		vTaskDelay(500);
		button=0;
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(TxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(TxBuffer[5]);
			Lcd_write_8b(TxBuffer[6]);
			Lcd_write_str(" ");
			push_tx();
			Lcd_write_digit(TxCounter);
			copy_arr(&TxBuffer, &LCDLine2, 7,9);
			vTaskDelay(20);
		}
		Lcd_clear();
}


void saveButtonRanges(void){
	uint8_t i=0;
	for (i=0; i<8; i++) {
		EE_WriteVariable(BUTTON_RANGES_START_ADDR+i, button_ranges[i]);
	}
}

void readButtonRanges(void){
	uint8_t i=0;
	for (i=0; i<8; i++) {
		EE_ReadVariable(BUTTON_RANGES_START_ADDR+i, &button_ranges[i]);
	}
}

FRESULT string2log(char* str, uint8_t bytes){

}


void adcAverager(void){
	uint8_t i=0;
	uint8_t i2=0;


	uint16_t jdrBuff1[JDR_BUFFER_SIZE];
	uint16_t jdrBuff2[JDR_BUFFER_SIZE];
	uint16_t jdrBuff3[JDR_BUFFER_SIZE];
	uint16_t jdrBuff4[JDR_BUFFER_SIZE];
	uint32_t jdrBuff1Total=0;
	uint32_t jdrBuff2Total=0;
	uint32_t jdrBuff3Total=0;
	uint32_t jdrBuff4Total=0;



	for(i2=0; i2<9; i2++){
	    for(i=0; i < 9; i++) {
	    	jdrBuff1[i] = jdrBuff1[i+1];
	    	jdrBuff2[i] = jdrBuff2[i+1];
	    	jdrBuff3[i] = jdrBuff3[i+1];
	    	jdrBuff4[i] = jdrBuff4[i+1];
 		}
 		jdrBuff1[JDR_BUFFER_SIZE-1] = ADC1->JDR1;
 		jdrBuff2[JDR_BUFFER_SIZE-1] = ADC1->JDR2;
 		jdrBuff3[JDR_BUFFER_SIZE-1] = ADC1->JDR3;
 		jdrBuff4[JDR_BUFFER_SIZE-1] = ADC1->JDR4;
    	jdrBuff1Total += jdrBuff1[JDR_BUFFER_SIZE-1];
    	jdrBuff2Total += jdrBuff2[JDR_BUFFER_SIZE-1];
    	jdrBuff3Total += jdrBuff3[JDR_BUFFER_SIZE-1];
    	jdrBuff4Total += jdrBuff4[JDR_BUFFER_SIZE-1];
	}
	    adcAverage[0] = jdrBuff1Total/10;
	    adcAverage[1] = jdrBuff2Total/10;
	    adcAverage[2] = jdrBuff3Total/10;
	    adcAverage[3] = jdrBuff4Total/10;
}


void set16bit(uint16_t value){
	button=0;
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (value<1) {
				value=65535;
			}
			else {
				value--;
			}
		}
		if (button==BUTTON_FWD) {
			if (value>65534) {
				value=0;
			}
			else {
				value++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("<");
		Lcd_write_digit(value);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	vTaskDelay(50);
	printOk();
}


void setPlug(uint8_t plugId){
	uint8_t timerId=0;
	uint16_t Address=0;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str("Plug ");
	Lcd_write_digit(++plugId);
	Lcd_write_str(" timer");
	plugId--;
	Address = EE_PLUG_SETTINGS+plugId;
	EE_ReadVariable(Address, &timerId);
	vTaskDelay(50);
	timerId = adjust8bit(timerId);
	vTaskDelay(50);
	Address = EE_PLUG_SETTINGS+plugId;
	EE_WriteVariable(Address, timerId);
	vTaskDelay(5);
	loadSettings();
	vTaskDelay(5);
}

void printOk(void){
	vTaskDelay(1);
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(500);
	Lcd_clear();
	vTaskDelay(1);
}

void psiStab(void){
//	uint8_t stabFlag=0;
//	uint8_t af1 = 0;
//	uint8_t af2 = 0
	if ((auto_flags&1)==1 && ((auto_failures&8)>>3)==0 && (auto_failures&1)==0 && comm_state==COMM_MONITOR_MODE) {			// PSI STAB flag is number 0
		if (adcAverage[AVG_ADC_PSI]>psi_pump_top_level) {
			plugStateSet(PSI_PUMP_ID, 0);
		}
		vTaskDelay(1);
		if (adcAverage[AVG_ADC_PSI]<psi_pump_btm_level) {
			plugStateSet(PSI_PUMP_ID, 1);
		}
	}
}

void timerStateTrigger(void *pvParameters){
	uint8_t i=0;
	uint8_t timerStateFlag=0;
	uint32_t now=0;
	uint32_t timer1=0;
	uint32_t timer2=0;
	uint16_t Address;
	vTaskDelay(20000);
	while (1) {
		now=RTC_GetCounter();
		for (i=0; i<4; i++){	// 4 tajmera
			Address = EE_TIMER1_ON+EE_TIMER_SIZE*i;
			timer1 = EE_ReadWord(Address);		// Timer ON
			timer2 = EE_ReadWord(Address+2);	// Timer OFF

			// for everyday triggering
			timer1 = timer1%86400;				// 86400s = 24h
			timer2 = timer2%86400;
			now = now % 86400;

			vTaskDelay(5);

			// logika obychnogo tajmera dlja timerOn<timerOff
			if (now<timer2 && now>timer1) {
				timerStateFlag=1;
			}
			else {
				timerStateFlag=0;
			}

			// obratnaja logika tajmera
			if (timer1>timer2) {
				if (now<timer1 && now>timer2) {
					timerStateFlag=0;
				}
				else {
					timerStateFlag=1;
				}
			}

			if (timerStateFlag==1) {
				timerStateFlags|=(1<<i);	// set flag
			}
			else {
				timerStateFlags &= ~(1<<i); // sbrosit' flag
			}
		}
		vTaskDelay(5);
		for (i=0; i<3; i++){	// do 3 tajmerov
			Address = EE_CTIMER_DURATION+EE_CTIMER_SIZE*i;
			timer1 = EE_ReadWord(Address);
			timer2 = EE_ReadWord(Address+2);
			vTaskDelay(5);
			now=RTC_GetCounter();

			// logika ciklicheskogo tajmera
			now %= timer2;
			if (now<timer1) {
				timerStateFlag=1;
				cTimerStateFlags|=(1<<i);
			}
			else {
				timerStateFlag=0;
				cTimerStateFlags &= ~(1<<i); // sbrosit' flag
			}
			vTaskDelay(5);
		}
	}
}



void plugStateTrigger(void *pvParameters){
	uint8_t plugStateFlag=0;
	uint8_t plugTimerId=0;
	uint8_t plugType=0;
	uint8_t i=0;
	while (1) {
		if (runners>250) {
			runners=0;
		}
		runners++;
		if (comm_state!=COMM_DIRECT_DRIVE) {
			for (i=0; i<PLUG_AMOUNT; i++){		// PC0 to PC2
				plugType=0;
				plugTimerId = plugSettings[i];	// get the ID of timer for this plug
				if (plugTimerId>=0 && plugTimerId<=31) {
					plugStateFlag=timerStateFlags&(1<<plugTimerId);	// check if timer active now
					plugStateFlag>>=plugTimerId;	// ostavit' toka flag
				}
				if (plugTimerId>63 && plugTimerId<67){	// ph up
					plugType=2;
					plugTimerId-=32;
				}
				if (plugTimerId>66 && plugTimerId<69){	// ph up
					plugType=3;
					plugTimerId-=35;
				}

				if (plugTimerId>69 && plugTimerId<72){	// ph up
					plugType=4;
				}
				if (plugTimerId==80){	// 80 - PSI stab
					plugType=5;
				}

				if (plugTimerId==99) {	//always on
					plugType=255;
					plugStateSet(i, 1);
				}
				if (plugTimerId==98) {	// always off
					plugType=254;
					plugStateSet(i, 0);
				}

				if (plugTimerId>31 && plugTimerId<64) {
					plugTimerId-=32;
					plugStateFlag=cTimerStateFlags&(1<<plugTimerId);	// check if timer active now
					plugStateFlag>>=plugTimerId;	// ostavit' toka flag
				}

