plantalog/cadi-gcl/stm32f100/grolly/current/main.c
				if (plugType==2) {
					if (plugStateFlag==0 && ((plugStateFlags>>i)&1)==1) {
						plugStateSet(i, 0);	// disable plug
					}
				}
				else if (plugType==3) {	// mister (or another humidity "upper")
					if (plugStateFlag==1 && ((plugStateFlags>>i)&1)==0 && plugTimerId==0 && rhUnderOver==1) {
						plugStateSet(i, 1);	// enable mister for underwindow
					}
					if (plugStateFlag==1 && ((plugStateFlags>>i)&1)==0 && plugTimerId==0 && rhUnderOver==0) {
						plugStateSet(i, 1);	// enable mister for in-window
					}
					if (plugStateFlag==0 && ((plugStateFlags>>i)&1)==1) {
						plugStateSet(i, 0);	// disable plug
					}
				}
				else if (plugType==4) {
					// watering and circulation pumps for watering controller
				}
				else if (plugType==5) {
				/*	if (auto_flags&1==1 && (auto_failures&1)==0) {			// PSI STAB flag is number 0
						if (adcAverage[AVG_ADC_PSI]>psi_pump_top_level) {
							plugStateSet(PSI_PUMP_ID, 0);
						}
						vTaskDelay(1);
						if (adcAverage[AVG_ADC_PSI]<psi_pump_btm_level) {
							plugStateSet(PSI_PUMP_ID, 1);
						}
					}	*/
									// psi pump pressure stabilizer
				}
				if (plugType==254) {

				}
				if (plugType==255) {

				}
				else {
				}
				vTaskDelay(1);
			}
		}
		vTaskDelay(5);
	}
}


void psiSetup(void){
	uint8_t curbutton=0, tmp;
	uint16_t curpsiadc=0, tmp2=0, tempvalue=0;
	comm_state=COMM_DIRECT_DRIVE;
	Lcd_clear();
	tmp2 = EE_PLUG_SETTINGS+PSI_PUMP_ID;
	EE_WriteVariable(tmp2, 80);		// HARDCODE!!! program (timer) id for booster pump
	plugSettings[tempvalue] = 80;
	Lcd_write_str("ADC psi reading");
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(1,0);
		Lcd_write_str("TOP:");
		if (curbutton==BUTTON_BCK){
			plugStateSet(PSI_PUMP_ID, 1);
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(PSI_PUMP_ID, 0);
		}
		if (curbutton==BUTTON_CNL){
			psi_pump_top_level = adcAverage[AVG_ADC_PSI];
		}
		vTaskDelay(25);
		Lcd_write_16b(adcAverage[AVG_ADC_PSI]);
		Lcd_write_str("/");
		Lcd_write_16b(psi_pump_top_level);
		curbutton=readButtons();
	}
	plugStateSet(PSI_PUMP_ID, 0);
	printOk();
	curbutton=0;
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(1,0);
		Lcd_write_str("BTM:");
		if (curbutton==BUTTON_BCK){
			plugStateSet(PSI_PUMP_ID, 1);
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(PSI_PUMP_ID, 0);
		}
		if (curbutton==BUTTON_CNL){
			psi_pump_btm_level = adcAverage[AVG_ADC_PSI];
		}
		vTaskDelay(10);
		Lcd_write_16b(adcAverage[AVG_ADC_PSI]);
		Lcd_write_str("/");
		Lcd_write_16b(psi_pump_btm_level);
		curbutton=readButtons();
	}
	plugStateSet(PSI_PUMP_ID, 0);
	comm_state=COMM_MONITOR_MODE;
	EE_WriteVariable(PSI_SENSOR_TOP, psi_pump_top_level);
	EE_WriteVariable(PSI_SENSOR_BTM, psi_pump_btm_level);
	printOk();
}

void plugTest(void){
	uint8_t curplug=0;
	uint8_t curbutton=0;
	comm_state=COMM_DIRECT_DRIVE;
	while (curbutton!=BUTTON_FWD){
		Lcd_goto(0,0);
		Lcd_write_str("Plug:");
		Lcd_write_digit(curplug);
		if (curbutton==BUTTON_BCK){
			curplug++;
			if (curplug==PLUG_AMOUNT) {
				curplug=0;
			}
		}
		if (curbutton==BUTTON_OK){
			plugStateSet(curplug, 1);
		}
		if (curbutton==BUTTON_CNL){
			plugStateSet(curplug, 0);
		}
		vTaskDelay(10);
		curbutton=readButtons();
	}
	comm_state=COMM_MONITOR_MODE;
}

void plugStateSet(uint8_t plug, uint8_t state){
#ifdef GROLLY
	if (plug==0) {
		state = 1 - state;	// invert. PSI pump is "0" driven
	}
#endif
	if (state==1) {
		PLUG_DISABLE = (1<<plug);
		plugStateFlags |= (1<<plug);
	}
	else {
		PLUG_ENABLE = (1<<plug);
		plugStateFlags &= ~(1<<plug);
	}
}

void valveMotorStateSet(uint8_t valveId, uint8_t state){
#ifdef USE_VALVES
#endif
}



void EE_WriteWord(uint16_t Address, uint32_t Data){
	uint16_t tmp, tmp2;
	tmp2 = Data & 0xFFFF;
	tmp = Data >> 16;
	EE_WriteVariable(Address+1, tmp2);
	EE_WriteVariable(Address, tmp);
}

void programRunner(uint8_t programId){


	/*
	 * *
	 * |-MONITOR MODE 			/ 0
	 * |-TESTS					/ 1
	 * |	|-Valves			/ 2
	 * |	|-Temp&Humidity		/ 3
	 * |	|-EEPROM			/ 4
	 * |	|-Plugs				/ 5
	 * |	|-Dosers			/ 6
	 * |	|-rest				/ 7
	 * |-TIMERS					/ 8
	 * |	|-24H/Full Range	/ 9
	 * |	|-Cyclic			/ 10
	 * |-STABILIZERS			/ 11
	 * |	|-CO2				/ 12
	 * |	|-Pressure			/ 13
	 * |	|-Tank levels		/ 14
	 * |	|-Temperature		/ 15
	 * |	|-Humidity			/ 16
	 * |	|-pH				/ 17
	 * |-SETTINGS				/ 18
	 * |	|-Dosers			/ 19
	 * |	|-Plug settings		/ 20
	 * |	|-Set clock			/ 21
	 * |-WATERING				/ 22
	 * |	|-Watering progs	/ 23
	 * |	|-Fertilization		/ 24
	*/


	uint32_t tmp=0;
	uint8_t tmp8=0;
	Lcd_clear();
	switch (programId) {
	case 1:
		break;
	case 2:		// valve_test
		valve_test2();
		break;
	case 3:		// temp. and humidity test
		dht_arr_displayer();
#ifdef	TEST_MODE
		displayAdcValues();	// test function to display ADC values
#endif
		display_usart_rx();
		display_usart_tx();
		break;
	case 4:		// eeprom test
		psiSetup();
		break;
	case 5:		// plug test
		plugTest();
		break;
	case 6:		// doser test
		break;
	case 7:		// rest tests
		break;
	case 8:		// 24h / full range timer setup
		Lcd_write_str("Timer to adjust:");
		tmp8 = idSelector(1,4,1);
	    setTimer(--tmp8);
		break;
	case 9:		// cyclic timer setup
		Lcd_write_str("CTimer 2 adjust:");
		tmp8 = idSelector(1,4,1);
	    setCTimer(--tmp8);
		break;
	case 10:	// co2 stabilizer
		co2_setup();
		break;
	case 11:	// pressure stabilizer setup
		break;
	case 13:	// tank level stabilizer
		tankLevelStabSetup();
		break;
	case 14:	// temp stab setup
		break;
	case 15:	// humidity stab setup
		hygroStatSettings();
		break;
	case 16:	// pH stab setup
//		phStabSettings();
		break;
	case 17:	// doser settings
		break;
	case 18:	// plug settings
		Lcd_write_str("Choose plug");
		tmp8 = idSelector(1,4,1);
		setPlug(--tmp8);	// decrement needed because of actual start from 0
		break;
	case 19:	// set clock
		tmp = RTC_GetCounter();
		uint32_t unixtime = timeAdjust(tmp, 1);
		RTC_SetCounter(unixtime);
		Lcd_clear();
		break;
	case 20:
		break;
	case 21:
		watering_setup();
		break;
	case 22:
		fertilization_setup();
		break;
	case 23:
		get_water(0,0,100);
		break;
	case 24:
		break;
	case 25:
		break;
	case 26:
		break;
	case 27:
		startWp();
		break;
	case 28:
		break;
	}
}

void loggerSettings(void){
	uint32_t logSetting;
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(SD_LOG_INTERVAL, &logSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Log frequency");
	vTaskDelay(3000);
	logSetting=adjust8bit(logSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	vTaskDelay(50);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

