plantalog/cadi-gcl/stm32f100/grolly/current/main.c
// mycontroller.ru code

uint32_t RTC_GetCounter(void)
{
  return  (uint32_t)((RTC->CNTH << 16) | RTC->CNTL);
}


void RTC_SetCounter(uint32_t value)
{
  RTC->CRL |= RTC_CRL_CNF;
  RTC->CNTH = value>>16;
  RTC->CNTL = value;
  RTC->CRL &= ~RTC_CRL_CNF;
}


unsigned char  RtcInit(void)
{

  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN;

  PWR->CR |= PWR_CR_DBP;

  if ((RCC->BDCR & RCC_BDCR_RTCEN) != RCC_BDCR_RTCEN)
  {
    RCC->BDCR |=  RCC_BDCR_BDRST;
    RCC->BDCR &= ~RCC_BDCR_BDRST;
    RCC->BDCR |=  RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_LSE;
    RTC->CRL  |=  RTC_CRL_CNF;
    RTC->PRLL  = 0x7FFF;        // divider to 32786 hZ
    RTC->CRL  &=  ~RTC_CRL_CNF;
    RCC->BDCR |= RCC_BDCR_LSEON;
    while ((RCC->BDCR & RCC_BDCR_LSEON) != RCC_BDCR_LSEON){}

    RTC->CRL &= (uint16_t)~RTC_CRL_RSF;
    while((RTC->CRL & RTC_CRL_RSF) != RTC_CRL_RSF){}
    return 1;
  }
  return 0;
}


 uint32_t TimeToRtc(RTC_Time *time )
{
  uint32_t result;
  result  = (uint32_t)time->hour * 3600;
  result += (uint32_t)time->min * 60;
  result +=           time->sec;
  return result;
}

 void RtcToTime( uint32_t cnt, RTC_Time *time )
 {
   time->sec = cnt % 60;
   cnt /= 60;
   time->min = cnt % 60;
   cnt /= 60;
   time->hour = cnt % 24;
 }

 // EOF mycontroller.ru RTC functions


// function slides the buffer window for pH ADC values (and EC)
void phMonitor(void *pvParameters){
 	while(1){
 		vTaskDelay(1);
 		adcAverager();
 	}
}

void copy_arr(volatile uint8_t *source, volatile uint8_t *destination, uint8_t amount, uint8_t pos){
	uint8_t i=0;
	for (i=0; i<amount;i++) {
		destination[i+pos] = source[i];
	}
}

void psiPwm(uint8_t val){
	TIM2->CCR3 = 1000-(val&(uint16_t)(0xFF))*(uint16_t)200;
	TIM2->CCR4 = 1000-(val&(uint16_t)(0xFF))*(uint16_t)200;
}


void displayClock(void *pvParameters)
{
		RTC_DateTime DateTime;
		uint32_t tmp=0;
		tmp = RTC_GetCounter();
		fup_time = RTC_GetCounter()+60;
		if (tmp<1388534400) {
			RTC_SetCounter(1400000000);
		}
		Lcd_clear();
		Lcd_write_str("Hello Buddy :)");
		Lcd_goto(1,0);
		Lcd_write_str("Let's GROW!");
		vTaskDelay(2000);
		Lcd_clear();
		Lcd_clear();
		Lcd_write_str("First, calibrate");
		Lcd_goto(1,0);
		Lcd_write_str("the buttons...");
		vTaskDelay(2000);
		buttonCalibration();
    	while (1)
	    {

    		psiPwm(button);

    		runners = 24;
	    	vTaskDelay(10);
    		tmp = RTC_GetCounter();
    		DateTime=unix2DateTime(tmp);
	    	LCDLine1[0]= (DateTime.day / 10) + 48;
	    	LCDLine1[1]= (DateTime.day % 10) + 48;
	    	LCDLine1[2]= 45;
	    	LCDLine1[3]= (DateTime.month / 10) + 48;
	    	LCDLine1[4]= (DateTime.month % 10) + 48;
	    	LCDLine1[5]= 45;
	    	LCDLine1[6]= (DateTime.year / 10) + 48;
	    	LCDLine1[7]= (DateTime.year % 10) + 48;
	    	LCDLine2[6]= 32;
	    	LCDLine2[7]= 32;
	    	Lcd_goto(1,0);
	    	Lcd_write_digit(DateTime.hour);
	    	Lcd_write_digit(DateTime.min);
	    	Lcd_write_digit(DateTime.sec);
	    	vTaskDelay(5);




#ifdef	TEST_MODE

#endif
#ifndef	TEST_MODE
	    	uint16_t flg;
	    	// vyvod flagov dozirujushih nasosov
	    	uint8_t i;
	    	for (i=0; i<3; i++) {
	    		flg=timerStateFlags&(1<<i);

	    		flg>>=i;
	    		LCDLine1[i+10]=flg+48;
	    	}
	    	// vyvod flagov rozetok
	    	for (i=0; i<3; i++) {
	    		flg=plugStateFlags&(1<<i);
	    		flg>>=i;
	    		LCDLine1[i+13]=flg+48;
	    	}
	    	LCDLine1[9]=phUnderOver+48;
#endif


	    	vTaskDelay(14);
	    	button=readButtons();
	    	vTaskDelay(3);
	    	Lcd_write_str(" ");
	    	Lcd_goto(1,8);
//	    	Lcd_write_digit(wpProgress);
	    	Lcd_write_digit(auto_failures&0xFF);
	    	Lcd_write_digit(valveFlags&0xFF);
	    	Lcd_write_digit(co2temp);
	    	if (button==BUTTON_OK) {
	    		co2temp=0;
	    	}
	    	if (button==BUTTON_OK)
	    	{
	    		vTaskDelay(100);
	    		Lcd_clear();
	    		vTaskDelay(500);
	    		uint8_t progId=menuSelector();
	    		programRunner(progId);
	    	}
	    	vTaskDelay(10);
	    }
    	while (1) {
    	}
}

uint8_t readButtons(void){
	uint16_t curval = 0;
	uint8_t i2 = 0;
	uint8_t i = 0;
	uint8_t a = 0;
	for (i2=0;i2<3;i2++) {
		adcAverager();
		curval = adcAverage[ADC_AVG_BUTTONS];
		vTaskDelay(1);
		for (i=0;i<4;i++) {
			if (curval>button_ranges[i*2]+BUTTON_RANGE_SHRINKER && curval<button_ranges[i*2+1]-BUTTON_RANGE_SHRINKER) {
				a += (i+1);
			}
		}
	}
	if (a%3==0) {
		return (a/3);
	}
	else {
		return 0;
	}
}

uint8_t readButtons2(void){
	uint16_t curval = 0;
	uint8_t i;
	adcAverager();
	curval = adcAverage[ADC_AVG_BUTTONS];
	for (i=0;i<4;i++) {
		if (curval>button_ranges[i*2]+BUTTON_RANGE_SHRINKER && curval<button_ranges[i*2+1]-BUTTON_RANGE_SHRINKER) {
			return (i+1);
		}
	}
	return 0;
}

void AdcInit(void)
{
	// WARNING NTBU (needs to be updated)! shifting pins down to 0 from 1st, saves some space on discovery board
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;

    GPIOC->CRL      &= ~GPIO_CRL_CNF0;		// LOAD triggering from PC0...
    GPIOC->CRL      &= ~GPIO_CRL_CNF1;
    GPIOC->CRL      &= ~GPIO_CRL_CNF2;
    GPIOC->CRL      &= ~GPIO_CRL_CNF3;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE0;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF0;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE1;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF1;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE2;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF2;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE3;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF3;

	  RCC->APB2ENR |=  RCC_APB2ENR_ADC1EN;
	  RCC->CFGR    &= ~RCC_CFGR_ADCPRE;
	  ADC1->CR1     =  0;
	  ADC1->CR2    |=  ADC_CR2_CAL;
	  while (!(ADC1->CR2 & ADC_CR2_CAL)){};
	  ADC1->CR2     =  ADC_CR2_JEXTSEL;
	  ADC1->CR2    |=  ADC_CR2_JEXTTRIG;
	  ADC1->CR2    |=  ADC_CR2_CONT;
	  ADC1->CR1    |=  ADC_CR1_SCAN;
	  ADC1->CR1    |=  ADC_CR1_JAUTO;
	  ADC1->JSQR    =  (uint32_t)(4-1)<<20;
	  ADC1->JSQR   |=  (uint32_t)1<<(5*0);
	  ADC1->JSQR   |=  (uint32_t)2<<(5*1);
	  ADC1->JSQR   |=  (uint32_t)3<<(5*2);
	  ADC1->JSQR   |=  (uint32_t)4<<(5*3);
	  ADC1->SMPR1  |=	0x00FFFFFF;
	  ADC1->CR2    |=  ADC_CR2_ADON;
	  ADC1->CR2    |=  ADC_CR2_JSWSTART;
}

void Lcd_write_digit2(uint8_t numb){
	if (numb<10) {
		Lcd_write_data(48);
		Lcd_write_data(48+numb);
	}
	else {
		Lcd_write_data((numb/10)+48);
		Lcd_write_data((numb-(numb/10)*10)+48);
	}
}

void Lcd_write_digit(uint8_t numb){
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine1[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
	else {
		LCDLine2[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine2[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
}





void prvSetupHardware()
{
	// LOAD triggering control pins init
	RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;     // Enable clock on GPIOC.
    GPIOC->CRL      &= ~GPIO_CRL_CNF0;		// LOAD triggering from PC0...
    GPIOC->CRL      &= ~GPIO_CRL_CNF1;
    GPIOC->CRL      &= ~GPIO_CRL_CNF2;
    GPIOC->CRL      &= ~GPIO_CRL_CNF3;		// ... to PC3

    GPIOC->CRL   |= GPIO_CRL_MODE0_0;
    GPIOC->CRL   |= GPIO_CRL_MODE1_0;
    GPIOC->CRL   |= GPIO_CRL_MODE2_0;
    GPIOC->CRL   |= GPIO_CRL_MODE3_0;
}


