plantalog/cadi-gcl/stm32f100/grolly/current/main.c
void vTaskLCDdraw(void *pvParameters) {	// draws lcd
	for (;;) {
		vTaskSuspendAll();
		Lcd_write_cmd(0x80);	// lcd_goto(0,0)
		Lcd_write_arr(&LCDLine1, 16);
		Lcd_write_cmd(0x80+0x40);	// lcd_goto(1,0)
		Lcd_write_arr(&LCDLine2, 16);
		xTaskResumeAll();
		vTaskDelay(17);
	}
}


void int32str(uint32_t d, volatile char *out)
{
    out[10] = '\0';
    out[9] = '0' + ( d       )    % 10;
    out[8] = '0' + ( d /= 10 )    % 10;
    out[7] = '0' + ( d /= 10 )    % 10;
    out[6] = '0' + ( d /= 10 )    % 10;
    out[5] = '0' + ( d /= 10 )    % 10;
    out[4] = '0' + ( d /= 10 )    % 10;
    out[3] = '0' + ( d /= 10 )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
}

uint32_t EE_ReadWord(uint16_t Address){
	uint16_t tmp=0, tmp2=0;
	uint32_t Data = 0;
	EE_ReadVariable(Address, &tmp);
	EE_ReadVariable(Address+1, &tmp2);
	Data = ((uint32_t)tmp << 16) + (uint32_t)tmp2;
	return Data;
}

void flush_lcd_buffer(void){
	uint8_t i=0;
	for (i=0;i<16;i++){
		LCDLine1[i]=32;
		LCDLine2[i]=32;
	}
}

void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
	TIM3->CCR3 = duty_cycle*10;
	TIM3->CCR4 = 1000 - duty_cycle*10;
}

void setDoserSpeed(uint8_t doser, uint8_t speed){
	uint16_t spd=0;
	uint32_t speeds1=0, speeds2=0;
	speeds1 = EE_ReadWord(DOSER_SPEEDS);
	if (doser==0) {
		TIM3->CCR1 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFFFF00)|speed;
	}
	if (doser==1) {
		TIM3->CCR2 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFF00FF)|(speed<<8);
	}
	if (doser==2) {
		TIM3->CCR3 = (100-speed)*10;
		speeds2 = (speeds1&0xFF00FFFF)|(speed<<16);
	}
	if (doser==3) {
		TIM3->CCR4 = (100-speed)*10;
		speeds2 = (speeds1&0xFFFFFF)|(speed<<24);
	}
	EE_WriteWord(DOSER_SPEEDS, speeds2);
}

void setDutyCycle(void){
	uint8_t duty_cycle;
	duty_cycle = TIM3->CCR3/10;
	Lcd_clear();
	button=0;
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("Crnt duty cycle");
		Lcd_goto(1,0);
		Lcd_write_digit(duty_cycle);
		if (button==BUTTON_FWD) {
			if (duty_cycle==99) {
			}
			else {
				duty_cycle++;
				setPwmDc(duty_cycle);
			}
		}
		if (button==BUTTON_BCK) {
			if (duty_cycle==0) {
			}
			else {
				duty_cycle--;
				setPwmDc(duty_cycle);
			}
		}
		vTaskDelay(20);
	}
	Lcd_clear();
}



void watchdog_init(void){
	// WATCHDOG check ###################
	__IO uint32_t LsiFreq = 40000;
		 /* Check if the system has resumed from IWDG reset */
		  if (RCC_GetFlagStatus(RCC_FLAG_IWDGRST) != RESET)
		  {
		    /* Clear reset flags */
		    RCC_ClearFlag();
		  }

		  /* IWDG timeout equal to 250 ms (the timeout may varies due to LSI frequency
		     dispersion) */
		  /* Enable write access to IWDG_PR and IWDG_RLR registers */
		  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

		  /* IWDG counter clock: LSI/32 */
		  IWDG_SetPrescaler(IWDG_Prescaler_32);

		  /* Set counter reload value to obtain 250ms IWDG TimeOut.
		     Counter Reload Value = 250ms/IWDG counter clock period
		                          = 250ms / (LSI/32)
		                          = 0.25s / (LsiFreq/32)
		                          = LsiFreq/(32 * 4)
		                          = LsiFreq/128
		   */
		  IWDG_SetReload(LsiFreq/16);

		  /* Reload IWDG counter */
		  IWDG_ReloadCounter();

		  /* Enable IWDG (the LSI oscillator will be enabled by hardware) */
		  IWDG_Enable();
}

uint8_t main(void)
{

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |RCC_APB2Periph_AFIO, ENABLE);
	// VALVE control pins init
	GPIO_InitTypeDef init_pin;
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
 	init_pin.GPIO_Pin  = GPIO_Pin_8 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &init_pin);
	// EOF VALVE INIT

	SystemInit();

	// INIT LOADS
	prvSetupHardware();
	plugStateSet(PSI_PUMP_ID, 0);	// disable all loads
	plugStateSet(1, 0);
	plugStateSet(2, 0);
	plugStateSet(3, 0);

	auto_failures = 0;
	uint32_t i;
	dosing_motor_control_init();
	psi_motor_init();
	for (i=0;i<4;i++) {
		enable_dosing_pump(i,0);	// startup disable dosing pumps
	}
	/* Unlock the Flash Program Erase controller */
	FLASH_Unlock();
	/* EEPROM Init */
	EE_Init();
	AdcInit();
	RtcInit();		//init real time clock
	co2_sens_start = RTC_GetCounter();
	co2_warmup_end = RTC_GetCounter() + CO2_WARMUP;
	fup_time = RTC_GetCounter();
	auto_failures = 0;
	// SOLENOID VALVE RE-INIT
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
 	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
 	init_pin.GPIO_Pin  =  GPIO_Pin_8 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &init_pin);
	// EOF SOLENOID VALVE RE-INIT


	// EOF LOADS init


	bluetooth_init();
	Init_lcd();

	sonar_init();

	Lcd_clear();

#ifdef GROLLY
#endif


	Lcd_clear();
	loadSettings();
	flush_lcd_buffer();	// fills the LCD frame buffer with spaces



	xTaskCreate(lstasks,(signed char*)"LST",configMINIMAL_STACK_SIZE,
	            NULL, tskIDLE_PRIORITY + 2, NULL);
	xTaskCreate(watering_program_trigger,(signed char*)"WP",180,
	            NULL, tskIDLE_PRIORITY + 1, NULL);
	xTaskCreate(uart_task,(signed char*)"UART",100,
	            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(displayClock,(signed char*)"CLK",140,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(timerStateTrigger,(signed char*)"TIMERS",configMINIMAL_STACK_SIZE+10,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(plugStateTrigger,(signed char*)"PLUGS",configMINIMAL_STACK_SIZE+35,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vTaskLCDdraw,(signed char*)"LCDDRW",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);

