plantalog/cadi-gcl/stm32f100/grolly/current/main.c
    watchdog_init();	// start watchdog timer

/* Start the scheduler. */

    vTaskStartScheduler();

    while(1);
}


void loadSettings(void){	// function loads the predefined data
	uint16_t i, Address, Data;
	char tmpstr[11], putstring[50];


	for (i=0; i<PLUG_AMOUNT; i++) {
		Address=EE_PLUG_SETTINGS+i;
		EE_ReadVariable(Address, &Data);
		plugSettings[i]=Data;
	}

	EE_ReadVariable(FWTANK_TOP, &tank_windows_top[FWTANK]);
	EE_ReadVariable(FWTANK_BOTTOM, &tank_windows_bottom[FWTANK]);
	EE_ReadVariable(MIXTANK_TOP, &tank_windows_top[MIXTANK]);
	EE_ReadVariable(MIXTANK_BOTTOM, &tank_windows_bottom[MIXTANK]);

	EE_ReadVariable(PSI_UNDERPRESSURE, &psi_upres_level);
	EE_ReadVariable(PSI_UP_TIMEOUT, &psi_upres_timeout);

	EE_ReadVariable(PSI_SENSOR_TOP, &psi_pump_top_level);
	EE_ReadVariable(PSI_SENSOR_BTM, &psi_pump_btm_level);

	for (i=0; i<WFM_AMOUNT; i++) {
		EE_ReadVariable(WFM_CAL_OFFSET+i, &wfCalArray[i]);
	}

	EE_ReadVariable(CO2_TOP, &co2_top);
	EE_ReadVariable(CO2_BTM, &co2_btm);
	EE_ReadVariable(CO2_400PPM, &co2_400ppm);

	readButtonRanges();
}


void Lcd_write_str(volatile uint8_t *STRING)
{
	uint8_t c=0;
	while (c=*STRING++){
		if (lcd_pointery==0) {
			LCDLine1[lcd_pointerx] = c;
			lcd_pointerx++;
		}
		else {
			LCDLine2[lcd_pointerx] = c;
			lcd_pointerx++;
		}
	}
}

void Lcd_goto(uc8 x,uc8 y)
{
	uint8_t str;
	str = y + 0x80;
	if(x == 1)
	{
	str+= 0x40;
	}
	Lcd_write_cmd(str);
	lcd_pointerx = y;
	lcd_pointery = x;
}


// Cadi mainboard LCD Init
void Init_pin_out()
{
	// Cadi MB pins for LCD are following:
	// data: PA15, PC10, PC11, PC12
	// cmd: PD2, PB3, PB4



	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB|RCC_APB2Periph_GPIOC|RCC_APB2Periph_GPIOD, ENABLE);
	GPIO_InitTypeDef init_pin;
	init_pin.GPIO_Pin  = GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &init_pin);
	init_pin.GPIO_Pin  = GPIO_Pin_15;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &init_pin);
	init_pin.GPIO_Pin  = GPIO_Pin_3 | GPIO_Pin_4;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &init_pin);
	init_pin.GPIO_Pin  = GPIO_Pin_2;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOD, &init_pin);
}


void Init_pin_out_bak()
{
	RCC_APB2PeriphClockCmd(lcd_init_port_data | lcd_init_port_cmd, ENABLE);
	GPIO_InitTypeDef init_pin;
	init_pin.GPIO_Pin  = pin_d7 | pin_d6 | pin_d5 | pin_d4;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(lcd_port_data, &init_pin);
	init_pin.GPIO_Pin  = pin_e | pin_rs | pin_rw;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(lcd_port_cmd, &init_pin);
}

void Init_pin_in()
{
	RCC_APB2PeriphClockCmd(lcd_init_port_data, ENABLE);
	GPIO_InitTypeDef init_pin;
	init_pin.GPIO_Pin  =  pin_d7 | pin_d6 | pin_d5 | pin_d4 ;
	init_pin.GPIO_Mode = GPIO_Mode_IPD;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init (lcd_port_data, &init_pin);
}

void Lcd_write_cmd(uint8_t cmd)
{
		Delay_us(6);	// stable 240
		rs_0;
		rw_0;
		e_1;
		Delay_us(1);
		set4highBits(cmd);
		e_0;
		Delay_us(1);
		e_1;
		Delay_us(1);
		set4lowBits(cmd);
		e_0;
		Delay_us(6);
}

void Lcd_write_data(uint8_t data)
{
	Delay_us(6);
	e_1;rs_1;rw_0;
	Delay_us(1);
	set4highBits(data);
	Delay_us(1);
	e_0;
	Delay_us(1);
	e_1;
	Delay_us(1);
	set4lowBits(data);
	Delay_us(1);
	e_0;
	Delay_us(1);
	e_0;rs_0;rw_0;
	Delay_us(6);
}

void set4highBits(uint8_t dta){		// setting higher 4 bits of word on corresponding GPIO pins
	if (dta&16) {
		d4_1;
	}
	else {
		d4_0;
	}
	if (dta&32) {
		d5_1;
	}
	else {
		d5_0;
	}
	if (dta&64) {
		d6_1;
	}
	else {
		d6_0;
	}
	if (dta&128) {
		d7_1;
	}
	else {
		d7_0;
	}
}


void set4lowBits(uint8_t dta){
	if (dta&1) {
		d4_1;
	}
	else {
		d4_0;
	}
	if (dta&2) {
		d5_1;
	}
	else {
		d5_0;
	}
	if (dta&4) {
		d6_1;
	}
	else {
		d6_0;
	}
	if (dta&8) {
		d7_1;
	}
	else {
		d7_0;
	}
}

void Init_lcd()
{
	Init_pin_out();
	  e_1;rs_0;rw_0;
	      Delay_us(100);	// assume 10ms
	      set4lowBits(0b0010);	// set 4 bit bus
	      e_0;
	      Delay_us(10);	// assume 10ms

	      Lcd_write_cmd(0b00101000);	// again, 4bit bus and the rest 4bits of whole command will get the destination now
	      Delay_us(10);
	  	  Lcd_write_cmd(Display_clear);
		  Lcd_write_cmd(0b00000110);	// function set
		  Lcd_write_cmd(0b00001100);	// display on cursor off
		  Lcd_write_cmd(Display_clear);	// function set
		  Lcd_write_str("12345678");
	  	Delay_us(10);
}

void Lcd_clear()
{
	Lcd_write_cmd(Display_clear);
	flush_lcd_buffer();
	Lcd_goto(0,0);
}

void Return_home()
{
	Lcd_write_cmd(0b0000001);
}
